[{
  "_id": {
    "$oid": "62b93e7ac4bddae857d2ae4f"
  },
  "genres": "Action",
  "id": "47778",
  "images": "https://cdn.myanimelist.net/images/anime/1908/120036l.jpg",
  "links": "https://animethemes.moe/video/KimetsuNoYaibaYuukakuHen-OP1.webm",
  "synopsis": "The devastation of the Mugen Train incident still weighs heavily on the members of the Demon Slayer Corps. Despite being given time to recover, life must go on, as the wicked never sleep: a vicious demon is terrorizing the alluring women of the Yoshiwara Entertainment District. The Sound Pillar, Tengen Uzui, and his three wives are on the case. However, when he soon loses contact with his spouses, Tengen fears the worst and enlists the help of Tanjirou Kamado, Zenitsu Agatsuma, and Inosuke Hashibira to infiltrate the district's most prominent houses and locate the depraved Upper Rank demon.",
  "title": "Kimetsu no Yaiba: Yuukaku-hen"
},{
  "_id": {
    "$oid": "62b93e7ac4bddae857d2ae50"
  },
  "genres": "Drama",
  "id": "23273",
  "images": "https://cdn.myanimelist.net/images/anime/3/67177l.jpg",
  "links": "https://animethemes.moe/video/KimiUso-OP1.webm",
  "synopsis": "Kousei Arima is a child prodigy known as the \"Human Metronome\" for playing the piano with precision and perfection. Guided by a strict mother and rigorous training, Kousei dominates every competition he enters, earning the admiration of his musical peers and praise from audiences. When his mother suddenly passes away, the subsequent trauma makes him unable to hear the sound of a piano, and he never takes the stage thereafter. Nowadays, Kousei lives a quiet and unassuming life as a junior high school student alongside his friends Tsubaki Sawabe and Ryouta Watari. While struggling to get over his mother's death, he continues to cling to music. His monochrome life turns upside down the day he encounters the eccentric violinist Kaori Miyazono, who thrusts him back into the spotlight as her accompanist. Through a little lie, these two young musicians grow closer together as Kaori tries to fill Kousei's world with color. [Written by MAL Rewrite]",
  "title": "Shigatsu wa Kimi no Uso"
},{
  "_id": {
    "$oid": "62b93e7ac4bddae857d2ae51"
  },
  "genres": "Adventure",
  "id": "223",
  "images": "https://cdn.myanimelist.net/images/anime/1887/92364l.jpg",
  "links": "https://animethemes.moe/video/DragonBall-OP1.webm",
  "synopsis": "Gokuu Son is a young boy who lives in the woods all alone—that is, until a girl named Bulma runs into him in her search for a set of magical objects called the \"Dragon Balls.\" Since the artifacts are said to grant one wish to whoever collects all seven, Bulma hopes to gather them and wish for a perfect boyfriend. Gokuu happens to be in possession of a dragon ball, but unfortunately for Bulma, he refuses to part ways with it, so she makes him a deal: he can tag along on her journey if he lets her borrow the dragon ball's power. With that, the two set off on the journey of a lifetime. They don't go on the journey alone. On the way, they meet the old Muten-Roshi and wannabe disciple Kuririn, with whom Gokuu trains to become a stronger martial artist for the upcoming World Martial Arts Tournament. However, it's not all fun and games; the ability to make any wish come true is a powerful one, and there are others who would do much worse than just wishing for a boyfriend. To stop those who would try to abuse the legendary power, they train to become stronger fighters, using their newfound strength to help the people around them along the way. [Written by MAL Rewrite]",
  "title": "Dragon Ball"
},{
  "_id": {
    "$oid": "62b93e7ac4bddae857d2ae52"
  },
  "genres": "Comedy",
  "id": "245",
  "images": "https://cdn.myanimelist.net/images/anime/13/11460l.jpg",
  "links": "https://animethemes.moe/video/GreatTeacherOnizuka-OP1.webm",
  "synopsis": "Twenty-two-year-old Eikichi Onizuka—ex-biker gang leader, conqueror of Shonan, and virgin—has a dream: to become the greatest high school teacher in all of Japan. This isn't because of a passion for teaching, but because he wants a loving teenage wife when he's old and gray. Still, for a perverted, greedy, and lazy delinquent, there is more to Onizuka than meets the eye. So when he lands a job as the homeroom teacher of the Class 3-4 at the prestigious Holy Forest Academy—despite suplexing the Vice Principal—all of his talents are put to the test, as this class is particularly infamous. Due to their utter contempt for all teachers, the class' students use psychological warfare to mentally break any new homeroom teacher they get, forcing them to quit and leave school. However, Onizuka isn't your average teacher, and he's ready for any challenge in his way. Bullying, suicide, and sexual harassment are just a few of the issues his students face daily. By tackling the roots of their problems, Onizuka supports them with his unpredictable and unconventional methods—even if it means jumping off a building to save a suicidal child. Thanks to his eccentric charm and fun-loving nature, Class 3-4 slowly learns just how enjoyable school can be when you're the pupils of the Great Teacher Onizuka. [Written by MAL Rewrite]",
  "title": "Great Teacher Onizuka"
},{
  "_id": {
    "$oid": "62b93e7ac4bddae857d2ae53"
  },
  "genres": "Sports",
  "id": "19647",
  "images": "https://cdn.myanimelist.net/images/anime/6/56147l.jpg",
  "links": "https://animethemes.moe/video/HajimeNoIppoRising-OP1.webm",
  "synopsis": "Japanese Featherweight Champion Makunouchi Ippo has defended his title belt once more with the help of his devastating signature move: the Dempsey Roll. However, new challengers are rising up left and right, claiming to have an answer for the move responsible for crushing his opponents. Will Ippo be able to step up to the challenge, or will the weight of his pride destroy him before he finds out just what it means to be strong? Meanwhile, fellow Kamogawa Gym mate Aoki Masaru is just a hop, skip, and a Frog Punch away from claiming his own belt, ready to take on the Japanese Lightweight Champion! Hajime no Ippo: Rising continues Ippo's quest to become stronger, featuring the same cast of loveable dimwits from Kamogawa Gym, as they put their bodies and hearts on the line to make their way in the harsh world of professional boxing. With a will of iron, Ippo steps into the ring once again. [Written by MAL Rewrite]",
  "title": "Hajime no Ippo: Rising"
},{
  "_id": {
    "$oid": "62b93e7ac4bddae857d2ae54"
  },
  "genres": "Avant Garde",
  "id": "28851",
  "images": "https://cdn.myanimelist.net/images/anime/1122/96435l.jpg",
  "links": "https://animethemes.moe/video/KoeNoKatachi-OP1.webm",
  "synopsis": "As a wild youth, elementary school student Shouya Ishida sought to beat boredom in the cruelest ways. When the deaf Shouko Nishimiya transfers into his class, Shouya and the rest of his class thoughtlessly bully her for fun. However, when her mother notifies the school, he is singled out and blamed for everything done to her. With Shouko transferring out of the school, Shouya is left at the mercy of his classmates. He is heartlessly ostracized all throughout elementary and middle school, while teachers turn a blind eye. Now in his third year of high school, Shouya is still plagued by his wrongdoings as a young boy. Sincerely regretting his past actions, he sets out on a journey of redemption: to meet Shouko once more and make amends. Koe no Katachi tells the heartwarming tale of Shouya's reunion with Shouko and his honest attempts to redeem himself, all while being continually haunted by the shadows of his past. [Written by MAL Rewrite]",
  "title": "Koe no Katachi"
}]