{
    "5114": {
        "id": "5114",
        "links": [
            "https://animethemes.moe/video/FullmetalAlchemistBrotherhood-OP1.webm",
            "https://animethemes.moe/video/FullmetalAlchemistBrotherhood-OP2.webm",
            "https://animethemes.moe/video/FullmetalAlchemistBrotherhood-OP3.webm",
            "https://animethemes.moe/video/FullmetalAlchemistBrotherhood-OP4.webm",
            "https://animethemes.moe/video/FullmetalAlchemistBrotherhood-OP5.webm",
            "https://animethemes.moe/video/FullmetalAlchemistBrotherhood-ED1.webm",
            "https://animethemes.moe/video/FullmetalAlchemistBrotherhood-ED2.webm",
            "https://animethemes.moe/video/FullmetalAlchemistBrotherhood-ED3.webm",
            "https://animethemes.moe/video/FullmetalAlchemistBrotherhood-ED4.webm",
            "https://animethemes.moe/video/FullmetalAlchemistBrotherhood-ED5.webm"
        ],
        "title": "Fullmetal Alchemist: Brotherhood",
        "synopsis": "After a horrific alchemy experiment goes wrong in the Elric household, brothers Edward and Alphonse are left in a catastrophic new reality. Ignoring the alchemical principle banning human transmutation, the boys attempted to bring their recently deceased mother back to life. Instead, they suffered brutal personal loss: Alphonse's body disintegrated while Edward lost a leg and then sacrificed an arm to keep Alphonse's soul in the physical realm by binding it to a hulking suit of armor. The brothers are rescued by their neighbor Pinako Rockbell and her granddaughter Winry. Known as a bio-mechanical engineering prodigy, Winry creates prosthetic limbs for Edward by utilizing \"automail,\" a tough, versatile metal used in robots and combat armor. After years of training, the Elric brothers set off on a quest to restore their bodies by locating the Philosopher's Stone—a powerful gem that allows an alchemist to defy the traditional laws of Equivalent Exchange. As Edward becomes an infamous alchemist and gains the nickname \"Fullmetal,\" the boys' journey embroils them in a growing conspiracy that threatens the fate of the world. [Written by MAL Rewrite]",
        "year": 2009,
        "season": "spring",
        "studios": "Bones",
        "genres": "Action",
        "rank": 1,
        "images": "https://cdn.myanimelist.net/images/anime/1223/96541l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "28977": {
        "id": "28977",
        "links": [
            "https://animethemes.moe/video/GintamaS3-OP1.webm",
            "https://animethemes.moe/video/GintamaS3-OP2.webm",
            "https://animethemes.moe/video/GintamaS3-OP2v2.webm",
            "https://animethemes.moe/video/GintamaS3-OP4.webm",
            "https://animethemes.moe/video/GintamaS3-OP4v2.webm",
            "https://animethemes.moe/video/GintamaS3-OP5.webm",
            "https://animethemes.moe/video/GintamaS3-OP5v2.webm",
            "https://animethemes.moe/video/GintamaS3-OP5v3.webm",
            "https://animethemes.moe/video/GintamaS3-OP5v4.webm",
            "https://animethemes.moe/video/GintamaS3-ED1.webm",
            "https://animethemes.moe/video/GintamaS3-ED1v2.webm",
            "https://animethemes.moe/video/GintamaS3-ED2.webm",
            "https://animethemes.moe/video/GintamaS3-ED3.webm",
            "https://animethemes.moe/video/GintamaS3-ED4.webm"
        ],
        "title": "Gintama°",
        "synopsis": "Gintoki, Shinpachi, and Kagura return as the fun-loving but broke members of the Yorozuya team! Living in an alternate-reality Edo, where swords are prohibited and alien overlords have conquered Japan, they try to thrive on doing whatever work they can get their hands on. However, Shinpachi and Kagura still haven't been paid... Does Gin-chan really spend all that cash playing pachinko? Meanwhile, when Gintoki drunkenly staggers home one night, an alien spaceship crashes nearby. A fatally injured crew member emerges from the ship and gives Gintoki a strange, clock-shaped device, warning him that it is incredibly powerful and must be safeguarded. Mistaking it for his alarm clock, Gintoki proceeds to smash the device the next morning and suddenly discovers that the world outside his apartment has come to a standstill. With Kagura and Shinpachi at his side, he sets off to get the device fixed; though, as usual, nothing is ever that simple for the Yorozuya team. Filled with tongue-in-cheek humor and moments of heartfelt emotion, Gintama's fourth season finds Gintoki and his friends facing both their most hilarious misadventures and most dangerous crises yet. [Written by MAL Rewrite]",
        "year": 2015,
        "season": "spring",
        "studios": "Bandai Namco Pictures",
        "genres": "Action",
        "rank": 2,
        "images": "https://cdn.myanimelist.net/images/anime/3/72078l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "38524": {
        "id": "38524",
        "links": [
            "https://animethemes.moe/video/ShingekiNoKyojinS3Part2-OP1.webm",
            "https://animethemes.moe/video/ShingekiNoKyojinS3Part2-ED1.webm",
            "https://animethemes.moe/video/ShingekiNoKyojinS3Part2-ED1v2.webm"
        ],
        "title": "Shingeki no Kyojin Season 3 Part 2",
        "synopsis": "Seeking to restore humanity's diminishing hope, the Survey Corps embark on a mission to retake Wall Maria, where the battle against the merciless \"Titans\" takes the stage once again. Returning to the tattered Shiganshina District that was once his home, Eren Yeager and the Corps find the town oddly unoccupied by Titans. Even after the outer gate is plugged, they strangely encounter no opposition. The mission progresses smoothly until Armin Arlert, highly suspicious of the enemy's absence, discovers distressing signs of a potential scheme against them. Shingeki no Kyojin Season 3 Part 2 follows Eren as he vows to take back everything that was once his. Alongside him, the Survey Corps strive—through countless sacrifices—to carve a path towards victory and uncover the secrets locked away in the Yeager family's basement. [Written by MAL Rewrite]",
        "year": 2019,
        "season": "spring",
        "studios": "Wit Studio",
        "genres": "Action",
        "rank": 3,
        "images": "https://cdn.myanimelist.net/images/anime/1517/100633l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "9253": {
        "id": "9253",
        "links": [
            "https://animethemes.moe/video/SteinsGate-OP1.webm",
            "https://animethemes.moe/video/SteinsGate-OP1v2.webm",
            "https://animethemes.moe/video/SteinsGate-ED1.webm",
            "https://animethemes.moe/video/SteinsGate-ED2.webm",
            "https://animethemes.moe/video/SteinsGate-ED3.webm",
            "https://animethemes.moe/video/SteinsGate-ED4.webm"
        ],
        "title": "Steins;Gate",
        "synopsis": "Eccentric scientist Rintarou Okabe has a never-ending thirst for scientific exploration. Together with his ditzy but well-meaning friend Mayuri Shiina and his roommate Itaru Hashida, Rintarou founds the Future Gadget Laboratory in the hopes of creating technological innovations that baffle the human psyche. Despite claims of grandeur, the only notable \"gadget\" the trio have created is a microwave that has the mystifying power to turn bananas into green goo. However, when Rintarou decides to attend neuroscientist Kurisu Makise's conference on time travel, he experiences a series of strange events that lead him to believe that there is more to the \"Phone Microwave\" gadget than meets the eye. Apparently able to send text messages into the past using the microwave, Rintarou dabbles further with the \"time machine,\" attracting the ire and attention of the mysterious organization SERN. Due to the novel discovery, Rintarou and his friends find themselves in an ever-present danger. As he works to mitigate the damage his invention has caused to the timeline, he is not only fighting a battle to save his loved ones, but also one against his degrading sanity. [Written by MAL Rewrite]",
        "year": 2011,
        "season": "spring",
        "studios": "White Fox",
        "genres": "Drama",
        "rank": 4,
        "images": "https://cdn.myanimelist.net/images/anime/5/73199l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "50265": {
        "id": "50265",
        "links": [
            "https://staging.animethemes.moe/video/SpyXFamily-OP1.webm",
            "https://staging.animethemes.moe/video/SpyXFamily-ED1.webm"
        ],
        "title": "Spy x Family",
        "synopsis": "Corrupt politicians, frenzied nationalists, and other warmongering forces constantly jeopardize the thin veneer of peace between neighboring countries Ostania and Westalis. In spite of their plots, renowned spy and master of disguise \"Twilight\" fulfills dangerous missions one after another in the hope that no child will have to experience the horrors of war. In the bustling Ostanian city of Berlint, Twilight dons the alias of \"Loid Forger,\" an esteemed psychiatrist. However, his true intention is to gather intelligence on prominent politician Donovan Desmond, who only appears rarely in public at his sons' school: the prestigious Eden Academy. Enlisting the help of unmarried city hall clerk Yor Briar to act as his wife and adopting the curious six-year-old orphan Anya as his daughter, Loid enacts his master plan. He will enroll Anya in Eden Academy, where Loid hopes she will excel and give him the opportunity to meet Donovan without arousing suspicion. Unfortunately for Loid, even a man of his talents has trouble playing the figure of a loving father and husband. And just like Loid is hiding his true identity, Yor—who is an underground assassin known as \"Thorn Princess\"—and Anya—an esper who can read people's minds—have no plans to disclose their own secrets either. Although this picture-perfect family is founded on deception, the Forgers gradually come to understand that the love they share for one another trumps all else. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "spring",
        "studios": "Wit Studio",
        "genres": "Action",
        "rank": 5,
        "images": "https://cdn.myanimelist.net/images/anime/1441/122795l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "9969": {
        "id": "9969",
        "links": [
            "https://animethemes.moe/video/GintamaS2-OP1.webm",
            "https://animethemes.moe/video/GintamaS2-OP1v2.webm",
            "https://animethemes.moe/video/GintamaS2-OP1v3.webm",
            "https://animethemes.moe/video/GintamaS2-OP2.webm",
            "https://animethemes.moe/video/GintamaS2-OP2v2.webm",
            "https://animethemes.moe/video/GintamaS2-OP3.webm",
            "https://animethemes.moe/video/GintamaS2-ED1.webm",
            "https://animethemes.moe/video/GintamaS2-ED2.webm",
            "https://animethemes.moe/video/GintamaS2-ED3.webm",
            "https://animethemes.moe/video/GintamaS2-ED4.webm",
            "https://animethemes.moe/video/GintamaS2-ED5.webm"
        ],
        "title": "Gintama'",
        "synopsis": "After a one-year hiatus, Shinpachi Shimura returns to Edo, only to stumble upon a shocking surprise: Gintoki and Kagura, his fellow Yorozuya members, have become completely different characters! Fleeing from the Yorozuya headquarters in confusion, Shinpachi finds that all the denizens of Edo have undergone impossibly extreme changes, in both appearance and personality. Most unbelievably, his sister Otae has married the Shinsengumi chief and shameless stalker Isao Kondou and is pregnant with their first child. Bewildered, Shinpachi agrees to join the Shinsengumi at Otae and Kondou's request and finds even more startling transformations afoot both in and out of the ranks of the the organization. However, discovering that Vice Chief Toushirou Hijikata has remained unchanged, Shinpachi and his unlikely Shinsengumi ally set out to return the city of Edo to how they remember it. With even more dirty jokes, tongue-in-cheek parodies, and shameless references, Gintama' follows the Yorozuya team through more of their misadventures in the vibrant, alien-filled world of Edo. [Written by MAL Rewrite]",
        "year": 2011,
        "season": "spring",
        "studios": "Sunrise",
        "genres": "Action",
        "rank": 6,
        "images": "https://cdn.myanimelist.net/images/anime/4/50361l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "11061": {
        "id": "11061",
        "links": [
            "https://animethemes.moe/video/HunterHunter2011-OP1.webm",
            "https://animethemes.moe/video/HunterHunter2011-OP1v2.webm",
            "https://animethemes.moe/video/HunterHunter2011-OP1v3.webm",
            "https://animethemes.moe/video/HunterHunter2011-OP1v4.webm",
            "https://animethemes.moe/video/HunterHunter2011-OP1v5.webm",
            "https://animethemes.moe/video/HunterHunter2011-OP1v6.webm",
            "https://animethemes.moe/video/HunterHunter2011-ED1.webm",
            "https://animethemes.moe/video/HunterHunter2011-ED2.webm",
            "https://animethemes.moe/video/HunterHunter2011-ED3.webm",
            "https://animethemes.moe/video/HunterHunter2011-ED4.webm",
            "https://animethemes.moe/video/HunterHunter2011-ED5.webm",
            "https://animethemes.moe/video/HunterHunter2011-ED6.webm"
        ],
        "title": "Hunter x Hunter (2011)",
        "synopsis": "Hunters devote themselves to accomplishing hazardous tasks, all from traversing the world's uncharted territories to locating rare items and monsters. Before becoming a Hunter, one must pass the Hunter Examination—a high-risk selection process in which most applicants end up handicapped or worse, deceased. Ambitious participants who challenge the notorious exam carry their own reason. What drives 12-year-old Gon Freecss is finding Ging, his father and a Hunter himself. Believing that he will meet his father by becoming a Hunter, Gon takes the first step to walk the same path. During the Hunter Examination, Gon befriends the medical student Leorio Paladiknight, the vindictive Kurapika, and ex-assassin Killua Zoldyck. While their motives vastly differ from each other, they band together for a common goal and begin to venture into a perilous world. [Written by MAL Rewrite]",
        "year": 2011,
        "season": "fall",
        "studios": "Madhouse",
        "genres": "Action",
        "rank": 7,
        "images": "https://cdn.myanimelist.net/images/anime/1337/99013l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "42938": {
        "id": "42938",
        "links": [
            "https://animethemes.moe/video/FruitsBasketS3-OP1.webm",
            "https://animethemes.moe/video/FruitsBasketS3-ED1.webm"
        ],
        "title": "Fruits Basket: The Final",
        "synopsis": "Hundreds of years ago, the Chinese Zodiac spirits and their god swore to stay together eternally. United by this promise, the possessed members of the Souma family shall always return to each other under any circumstances. Yet, when these bonds shackle them from freedom, it becomes an undesirable burden—a curse. As head of the clan, Akito is convinced that he shares a special connection with the other Soumas. While he desperately clings to this fantasy, the rest of the family remains isolated and suppressed by the fear of punishment. Tooru Honda, who has grown attached to the Soumas, is determined to break the chains that bind them. Her companionship with the family and her friends encourages her to move forward with lifting the curse. However, due to confounding revelations, she struggles to find the tenacity to continue her endeavors. With time slowly withering away, Tooru contends with an uncertain future in hopes of reaching the tranquility that may lie beyond all this commotion. [Written by MAL Rewrite]",
        "year": 2021,
        "season": "spring",
        "studios": "TMS Entertainment",
        "genres": "Drama",
        "rank": 8,
        "images": "https://cdn.myanimelist.net/images/anime/1085/114792l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "15417": {
        "id": "15417",
        "links": [
            "https://animethemes.moe/video/GintamaEnchousen-OP1.webm",
            "https://animethemes.moe/video/GintamaEnchousen-OP2.webm",
            "https://animethemes.moe/video/GintamaEnchousen-OP3.webm",
            "https://animethemes.moe/video/GintamaEnchousen-ED1.webm",
            "https://animethemes.moe/video/GintamaEnchousen-ED1v2.webm",
            "https://animethemes.moe/video/GintamaEnchousen-ED2.webm",
            "https://animethemes.moe/video/GintamaEnchousen-ED3.webm",
            "https://animethemes.moe/video/GintamaEnchousen-ED3v2.webm",
            "https://animethemes.moe/video/GintamaEnchousen-ED4.webm"
        ],
        "title": "Gintama': Enchousen",
        "synopsis": "While Gintoki Sakata was away, the Yorozuya found themselves a new leader: Kintoki, Gintoki's golden-haired doppelganger. In order to regain his former position, Gintoki will need the help of those around him, a troubling feat when no one can remember him! Between Kintoki and Gintoki, who will claim the throne as the main character? In addition, Yorozuya make a trip back down to red-light district of Yoshiwara to aid an elderly courtesan in her search for her long-lost lover. Although the district is no longer in chains beneath the earth's surface, the trio soon learn of the tragic backstories of Yoshiwara's inhabitants that still haunt them. With flashback after flashback, this quest has Yorozuya witnessing everlasting love and protecting it as best they can with their hearts and souls. Gintama': Enchousen includes moments of action-packed intensity along with their usual lighthearted, slapstick humor for Gintoki and his friends. [Written by MAL Rewrite]",
        "year": 2012,
        "season": "fall",
        "studios": "Sunrise",
        "genres": "Action",
        "rank": 10,
        "images": "https://cdn.myanimelist.net/images/anime/6/75172l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "39486": {
        "id": "39486",
        "links": [
            "https://animethemes.moe/video/GintamaTheFinal-ED1.webm"
        ],
        "title": "Gintama: The Final",
        "synopsis": "Two years have passed following the Tendoshuu's invasion of the O-Edo Central Terminal. Since then, the Yorozuya have gone their separate ways. Foreseeing Utsuro's return, Gintoki Sakata begins surveying Earth's ley lines for traces of the other man's Altana. After an encounter with the remnants of the Tendoshuu—who continue to press on in search of immortality—Gintoki returns to Edo. Later, the regrouped Shinsengumi and Yorozuya begin an attack on the occupied Central Terminal. With the Altana harvested by the wreckage of the Tendoshuu's ship in danger of detonating, the Yorozuya and their allies fight their enemies while the safety of Edo—and the rest of the world—hangs in the balance. Fulfilling the wishes of their teacher, Shouyou Yoshida's former students unite and relive their pasts one final time in an attempt to save their futures. [Written by MAL Rewrite]",
        "year": 2011,
        "season": "Winter",
        "studios": "Bandai Namco Pictures",
        "genres": "Action",
        "rank": 10,
        "images": "https://cdn.myanimelist.net/images/anime/1988/113791l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "820": {
        "id": "820",
        "links": [
            "https://animethemes.moe/video/GingaEiyuuDensetsu-OP1.webm",
            "https://animethemes.moe/video/GingaEiyuuDensetsu-OP2.webm",
            "https://animethemes.moe/video/GingaEiyuuDensetsu-OP3.webm",
            "https://animethemes.moe/video/GingaEiyuuDensetsu-OP4.webm",
            "https://animethemes.moe/video/GingaEiyuuDensetsu-ED1.webm",
            "https://animethemes.moe/video/GingaEiyuuDensetsu-ED2.webm",
            "https://animethemes.moe/video/GingaEiyuuDensetsu-ED3.webm",
            "https://animethemes.moe/video/GingaEiyuuDensetsu-ED4.webm"
        ],
        "title": "Ginga Eiyuu Densetsu",
        "synopsis": "The 150-year-long stalemate between the two interstellar superpowers, the Galactic Empire and the Free Planets Alliance, comes to an end when a new generation of leaders arises: the idealistic military genius Reinhard von Lohengramm, and the FPA's reserved historian, Yang Wenli. While Reinhard climbs the ranks of the Empire with the aid of his childhood friend, Siegfried Kircheis, he must fight not only the war, but also the remnants of the crumbling Goldenbaum Dynasty in order to free his sister from the Kaiser and unify humanity under one genuine ruler. Meanwhile, on the other side of the galaxy, Yang—a strong supporter of democratic ideals—has to stand firm in his beliefs, despite the struggles of the FPA, and show his pupil, Julian Mintz, that autocracy is not the solution. As ideologies clash amidst the war's many casualties, the two strategic masterminds must ask themselves what the real reason behind their battle is. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "K-Factory",
        "genres": "Drama",
        "rank": 11,
        "images": "https://cdn.myanimelist.net/images/anime/13/13225l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "34096": {
        "id": "34096",
        "links": [
            "https://animethemes.moe/video/GintamaS5-OP1.webm",
            "https://animethemes.moe/video/GintamaS5-ED1.webm"
        ],
        "title": "Gintama.",
        "synopsis": "After joining the resistance against the bakufu, Gintoki and the gang are in hiding, along with Katsura and his Joui rebels. The Yorozuya is soon approached by Nobume Imai and two members of the Kiheitai, who explain that the Harusame pirates have turned against 7th Division Captain Kamui and their former ally Takasugi. The Kiheitai present Gintoki with a job: find Takasugi, who has been missing since his ship was ambushed in a Harusame raid. Nobume also makes a stunning revelation regarding the Tendoushuu, a secret organization pulling the strings of numerous factions, and their leader Utsuro, the shadowy figure with an uncanny resemblance to Gintoki's former teacher. Hitching a ride on Sakamoto's space ship, the Yorozuya and Katsura set out for Rakuyou, Kagura's home planet, where the various factions have gathered and tensions are brewing. Long-held grudges, political infighting, and the Tendoushuu's sinister overarching plan finally culminate into a massive, decisive battle on Rakuyou. [Written by MAL Rewrite]",
        "year": 2017,
        "season": "winter",
        "studios": "Bandai Namco Pictures",
        "genres": "Action",
        "rank": 12,
        "images": "https://cdn.myanimelist.net/images/anime/3/83528l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "43608": {
        "id": "43608",
        "links": [
            "https://staging.animethemes.moe/video/KaguyaSamaWaKokurasetaiS3-OP1.webm",
            "https://staging.animethemes.moe/video/KaguyaSamaWaKokurasetaiS3-ED1.webm",
            "https://staging.animethemes.moe/video/KaguyaSamaWaKokurasetaiS3-ED2.webm"
        ],
        "title": "Kaguya-sama wa Kokurasetai: Ultra Romantic",
        "synopsis": "The elite members of Shuchiin Academy's student council continue their competitive day-to-day antics. Council president Miyuki Shirogane clashes daily against vice-president Kaguya Shinomiya, each fighting tooth and nail to trick the other into confessing their romantic love. Kaguya struggles within the strict confines of her wealthy, uptight family, rebelling against her cold default demeanor as she warms to Shirogane and the rest of her friends. Meanwhile, council treasurer Yuu Ishigami suffers under the weight of his hopeless crush on Tsubame Koyasu, a popular upperclassman who helps to instill a new confidence in him. Miko Iino, the newest student council member, grows closer to the rule-breaking Ishigami while striving to overcome her own authoritarian moral code. As love further blooms at Shuchiin Academy, the student council officers drag their outsider friends into increasingly comedic conflicts. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "spring",
        "studios": "A-1 Pictures",
        "genres": "Comedy",
        "rank": 13,
        "images": "https://cdn.myanimelist.net/images/anime/1160/122627l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "35180": {
        "id": "35180",
        "links": [
            "https://animethemes.moe/video/SangatsuNoLionS2-OP1.webm",
            "https://animethemes.moe/video/SangatsuNoLionS2-OP2.webm",
            "https://animethemes.moe/video/SangatsuNoLionS2-ED1.webm",
            "https://animethemes.moe/video/SangatsuNoLionS2-ED2.webm"
        ],
        "title": "3-gatsu no Lion 2nd Season",
        "synopsis": "Now in his second year of high school, Rei Kiriyama continues pushing through his struggles in the professional shogi world as well as his personal life. Surrounded by vibrant personalities at the shogi hall, the school club, and in the local community, his solitary shell slowly begins to crack. Among them are the three Kawamoto sisters—Akari, Hinata, and Momo—who forge an affectionate and familial bond with Rei. Through these ties, he realizes that everyone is burdened by their own emotional hardships and begins learning how to rely on others while supporting them in return. Nonetheless, the life of a professional is not easy. Between tournaments, championships, and title matches, the pressure mounts as Rei advances through the ranks and encounters incredibly skilled opponents. As he manages his relationships with those who have grown close to him, the shogi player continues to search for the reason he plays the game that defines his career. [Written by MAL Rewrite]",
        "year": 2017,
        "season": "fall",
        "studios": "Shaft",
        "genres": "Drama",
        "rank": 14,
        "images": "https://cdn.myanimelist.net/images/anime/3/88469l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "918": {
        "id": "918",
        "links": [
            "https://animethemes.moe/video/Gintama-OP1.webm",
            "https://animethemes.moe/video/Gintama-OP2.webm",
            "https://animethemes.moe/video/Gintama-OP3.webm",
            "https://animethemes.moe/video/Gintama-OP4.webm",
            "https://animethemes.moe/video/Gintama-OP5.webm",
            "https://animethemes.moe/video/Gintama-OP6.webm",
            "https://animethemes.moe/video/Gintama-OP7.webm",
            "https://animethemes.moe/video/Gintama-OP8.webm",
            "https://animethemes.moe/video/Gintama-OP8v2.webm",
            "https://animethemes.moe/video/Gintama-ED1.webm",
            "https://animethemes.moe/video/Gintama-ED2.webm",
            "https://animethemes.moe/video/Gintama-ED3.webm",
            "https://animethemes.moe/video/Gintama-ED4.webm",
            "https://animethemes.moe/video/Gintama-ED5.webm",
            "https://animethemes.moe/video/Gintama-ED6.webm",
            "https://animethemes.moe/video/Gintama-ED6v2.webm",
            "https://animethemes.moe/video/Gintama-ED6v3.webm",
            "https://animethemes.moe/video/Gintama-ED7.webm",
            "https://animethemes.moe/video/Gintama-ED7v2.webm",
            "https://animethemes.moe/video/Gintama-ED8.webm",
            "https://animethemes.moe/video/Gintama-ED8v2.webm",
            "https://animethemes.moe/video/Gintama-ED9.webm",
            "https://animethemes.moe/video/Gintama-ED10.webm",
            "https://animethemes.moe/video/Gintama-ED11.webm",
            "https://animethemes.moe/video/Gintama-ED11v2.webm",
            "https://animethemes.moe/video/Gintama-ED12.webm",
            "https://animethemes.moe/video/Gintama-ED13.webm",
            "https://animethemes.moe/video/Gintama-ED14.webm",
            "https://animethemes.moe/video/Gintama-ED14v2.webm",
            "https://animethemes.moe/video/Gintama-ED15.webm",
            "https://animethemes.moe/video/Gintama-ED16.webm",
            "https://animethemes.moe/video/YorinukiGintamaSan-OP1.webm",
            "https://animethemes.moe/video/YorinukiGintamaSan-OP2.webm",
            "https://animethemes.moe/video/YorinukiGintamaSan-OP3.webm",
            "https://animethemes.moe/video/YorinukiGintamaSan-OP4.webm",
            "https://animethemes.moe/video/YorinukiGintamaSan-ED1.webm",
            "https://animethemes.moe/video/YorinukiGintamaSan-ED2.webm",
            "https://animethemes.moe/video/YorinukiGintamaSan-ED3.webm",
            "https://animethemes.moe/video/YorinukiGintamaSan-ED4.webm"
        ],
        "title": "Gintama",
        "synopsis": "Edo is a city that was home to the vigor and ambition of samurai across the country. However, following feudal Japan's surrender to powerful aliens known as the \"Amanto,\" those aspirations now seem unachievable. With the once-influential shogunate rebuilt as a puppet government, a new law is passed that promptly prohibits all swords in public. Enter Gintoki Sakata, an eccentric silver-haired man who always carries around a wooden sword and maintains his stature as a samurai despite the ban. As the founder of Yorozuya, a small business for odd jobs, Gintoki often embarks on endeavors to help other people—though usually in rather strange and unforeseen ways. Assisted by Shinpachi Shimura, a boy with glasses supposedly learning the way of the samurai; Kagura, a tomboyish girl with superhuman strength and an endless appetite; and Sadaharu, their giant pet dog who loves biting on people's heads, the Yorozuya encounter anything from alien royalty to scuffles with local gangs in the ever-changing world of Edo. [Written by MAL Rewrite]",
        "year": 2006,
        "season": "spring",
        "studios": "Sunrise",
        "genres": "Action",
        "rank": 15,
        "images": "https://cdn.myanimelist.net/images/anime/10/73274l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "28851": {
        "id": "28851",
        "links": [
            "https://animethemes.moe/video/KoeNoKatachi-OP1.webm",
            "https://animethemes.moe/video/KoeNoKatachi-ED1.webm"
        ],
        "title": "Koe no Katachi",
        "synopsis": "As a wild youth, elementary school student Shouya Ishida sought to beat boredom in the cruelest ways. When the deaf Shouko Nishimiya transfers into his class, Shouya and the rest of his class thoughtlessly bully her for fun. However, when her mother notifies the school, he is singled out and blamed for everything done to her. With Shouko transferring out of the school, Shouya is left at the mercy of his classmates. He is heartlessly ostracized all throughout elementary and middle school, while teachers turn a blind eye. Now in his third year of high school, Shouya is still plagued by his wrongdoings as a young boy. Sincerely regretting his past actions, he sets out on a journey of redemption: to meet Shouko once more and make amends. Koe no Katachi tells the heartwarming tale of Shouya's reunion with Shouko and his honest attempts to redeem himself, all while being continually haunted by the shadows of his past. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Kyoto Animation",
        "genres": "Drama",
        "rank": 16,
        "images": "https://cdn.myanimelist.net/images/anime/1122/96435l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "37987": {
        "id": "37987",
        "links": [
            "https://animethemes.moe/video/VioletEvergardenMovie-ED1.webm",
            "https://animethemes.moe/video/VioletEvergardenMovie-ED2.webm"
        ],
        "title": "Violet Evergarden Movie",
        "synopsis": "Several years have passed since the end of The Great War. As the radio tower in Leidenschaftlich continues to be built, telephones will soon become more relevant, leading to a decline in demand for \"Auto Memory Dolls.\" Even so, Violet Evergarden continues to rise in fame after her constant success with writing letters. However, sometimes the one thing you long for is the one thing that does not appear. Violet Evergarden Movie follows Violet as she continues to comprehend the concept of emotion and the meaning of love. At the same time, she pursues a glimmer of hope that the man who once told her, \"I love you,\" may still be alive even after the many years that have passed. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Kyoto Animation",
        "genres": "Drama",
        "rank": 17,
        "images": "https://cdn.myanimelist.net/images/anime/1825/110716l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "4181": {
        "id": "4181",
        "links": [
            "https://animethemes.moe/video/ClannadAfterStory-OP1.webm",
            "https://animethemes.moe/video/ClannadAfterStory-ED1.webm",
            "https://animethemes.moe/video/ClannadAfterStory-ED1v2.webm",
            "https://animethemes.moe/video/ClannadAfterStory-ED1v3.webm",
            "https://animethemes.moe/video/ClannadAfterStory-ED1v4.webm",
            "https://animethemes.moe/video/ClannadAfterStory-ED2.webm"
        ],
        "title": "Clannad: After Story",
        "synopsis": "Clannad: After Story, the sequel to the critically acclaimed slice-of-life series Clannad, begins after Tomoya Okazaki and Nagisa Furukawa graduate from high school. Together, they experience the emotional rollercoaster of growing up. Unable to decide on a course for his future, Tomoya learns the value of a strong work ethic and discovers the strength of Nagisa's support. Through the couple's dedication and unity of purpose, they push forward to confront their personal problems, deepen their old relationships, and create new bonds. Time also moves on in the Illusionary World. As the plains grow cold with the approach of winter, the Illusionary Girl and the Garbage Doll are presented with a difficult situation that reveals the World's true purpose. Based on the visual novel by Key and produced by Kyoto Animation, Clannad: After Story is an impactful drama highlighting the importance of family and the struggles of adulthood. [Written by MAL Rewrite]",
        "year": 2008,
        "season": "fall",
        "studios": "Kyoto Animation",
        "genres": "Drama",
        "rank": 18,
        "images": "https://cdn.myanimelist.net/images/anime/1299/110774l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "15335": {
        "id": "15335",
        "links": [
            "https://animethemes.moe/video/GintamaMovie2-ED1.webm",
            "https://animethemes.moe/video/GintamaMovie2-ED2.webm"
        ],
        "title": "Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare",
        "synopsis": "When Gintoki apprehends a movie pirate at a premiere, he checks the camera's footage and finds himself transported to a bleak, post-apocalyptic version of Edo, where a mysterious epidemic called the \"White Plague\" has ravished the world's population. It turns out that the movie pirate wasn't a pirate after all—it was an android time machine, and Gintoki has been hurtled five years into the future! Shinpachi and Kagura, his Yorozuya cohorts, have had a falling out and are now battle-hardened solo vigilantes and he himself has been missing for years, disappearing without a trace after scribbling a strange message in his journal. Setting out in the disguise given to him by the android time machine, Gintoki haphazardly reunites the Yorozuya team to investigate the White Plague, and soon discovers that the key to saving the future lies in the darkness of his own past. Determined to confront a powerful foe, he makes an important discovery—with a ragtag band of friends and allies at his side, he doesn't have to fight alone. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Sunrise",
        "genres": "Action",
        "rank": 19,
        "images": "https://cdn.myanimelist.net/images/anime/10/51723l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "2904": {
        "id": "2904",
        "links": [
            "https://animethemes.moe/video/CodeGeassR2-OP1.webm",
            "https://animethemes.moe/video/CodeGeassR2-OP2.webm",
            "https://animethemes.moe/video/CodeGeassR2-OP2v2.webm",
            "https://animethemes.moe/video/CodeGeassR2-ED1.webm",
            "https://animethemes.moe/video/CodeGeassR2-ED2.webm",
            "https://animethemes.moe/video/CodeGeassR2-ED2v2.webm"
        ],
        "title": "Code Geass: Hangyaku no Lelouch R2",
        "synopsis": "One year has passed since the Black Rebellion, a failed uprising against the Holy Britannian Empire led by the masked vigilante Zero, who is now missing. At a loss without their revolutionary leader, Area 11's resistance group—the Black Knights—find themselves too powerless to combat the brutality inflicted upon the Elevens by Britannia, which has increased significantly in order to crush any hope of a future revolt. Lelouch Lamperouge, having lost all memory of his double life, is living peacefully alongside his friends as a high school student at Ashford Academy. His former partner C.C., unable to accept this turn of events, takes it upon herself to remind him of his past purpose, hoping that the mastermind Zero will rise once again to finish what he started, in this thrilling conclusion to the series. [Written by MAL Rewrite]",
        "year": 2008,
        "season": "spring",
        "studios": "Sunrise",
        "genres": "Action",
        "rank": 20,
        "images": "https://cdn.myanimelist.net/images/anime/4/9391l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "35247": {
        "id": "35247",
        "links": [
            "https://animethemes.moe/video/OwarimonogatariS2-OP1.webm",
            "https://animethemes.moe/video/OwarimonogatariS2-OP2.webm",
            "https://animethemes.moe/video/OwarimonogatariS2-OP3.webm",
            "https://animethemes.moe/video/OwarimonogatariS2-ED1.webm",
            "https://animethemes.moe/video/OwarimonogatariS2-ED1v2.webm",
            "https://animethemes.moe/video/OwarimonogatariS2-ED1v3.webm"
        ],
        "title": "Owarimonogatari 2nd Season",
        "synopsis": "Following an encounter with oddity specialist Izuko Gaen, third-year high school student Koyomi Araragi wakes up in a strange, deserted void only to be greeted by a joyfully familiar face in an alarmingly unfamiliar place. Araragi, with the help of his girlfriend Hitagi Senjougahara, maneuvers through the webs of his past and the perplexities of the present in search of answers. However, fate once again delivers him to the eccentric transfer student Ougi Oshino, who brings forth an unexpected proposal that may unearth the very foundation to which he is anchored. As Araragi peels back the layers of mystery surrounding an apparition, he discovers a truth not meant to be revealed. [Written by MAL Rewrite]",
        "year": 2017,
        "season": "summer",
        "studios": "Shaft",
        "genres": "Comedy",
        "rank": 21,
        "images": "https://cdn.myanimelist.net/images/anime/6/87322l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "37491": {
        "id": "37491",
        "links": [
            "https://animethemes.moe/video/GintamaShiroganeNoTamashiiHenS2-OP1.webm",
            "https://animethemes.moe/video/GintamaShiroganeNoTamashiiHenS2-OP1v2.webm",
            "https://animethemes.moe/video/GintamaShiroganeNoTamashiiHenS2-ED1.webm"
        ],
        "title": "Gintama.: Shirogane no Tamashii-hen - Kouhan-sen",
        "synopsis": "Following the temporary retreat of the Altana Liberation Army from the Kabuki District, the state of the war has seemingly improved. However, as the Oniwaban, Shinsengumi, and residents of the district combat the army's remnants, Edo's greatest inventor Gengai Hiraga is abducted. Responsible for causing the enemy's withdrawal by rendering their weapons useless, Gengai's nanomachine virus is now at risk of being shut down. Meanwhile, a laser capable of obliterating a planet is activated in Earth's orbit on the Liberation Army's mother ship. Another battle ensues when Shinsuke Takasugi and the rest of the Kiheitai arrive on the vessel to stop the weapon from firing. Forced to fight a war on two fronts, the Yorozuya and their allies must prevail on both sides to save Edo and the rest of the world. [Written by MAL Rewrite]",
        "year": 2018,
        "season": "summer",
        "studios": "Bandai Namco Pictures",
        "genres": "Action",
        "rank": 22,
        "images": "https://cdn.myanimelist.net/images/anime/1776/96566l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "47778": {
        "id": "47778",
        "links": [
            "https://animethemes.moe/video/KimetsuNoYaibaYuukakuHen-OP1.webm",
            "https://animethemes.moe/video/KimetsuNoYaibaYuukakuHen-ED1.webm"
        ],
        "title": "Kimetsu no Yaiba: Yuukaku-hen",
        "synopsis": "The devastation of the Mugen Train incident still weighs heavily on the members of the Demon Slayer Corps. Despite being given time to recover, life must go on, as the wicked never sleep: a vicious demon is terrorizing the alluring women of the Yoshiwara Entertainment District. The Sound Pillar, Tengen Uzui, and his three wives are on the case. However, when he soon loses contact with his spouses, Tengen fears the worst and enlists the help of Tanjirou Kamado, Zenitsu Agatsuma, and Inosuke Hashibira to infiltrate the district's most prominent houses and locate the depraved Upper Rank demon. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "winter",
        "studios": "ufotable",
        "genres": "Action",
        "rank": 23,
        "images": "https://cdn.myanimelist.net/images/anime/1908/120036l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "32281": {
        "id": "32281",
        "links": [
            "https://animethemes.moe/video/KimiNoNaWa-OP1.webm",
            "https://animethemes.moe/video/KimiNoNaWa-ED1.webm",
            "https://animethemes.moe/video/KimiNoNaWaDub-OP1.webm",
            "https://animethemes.moe/video/KimiNoNaWaDub-ED1.webm"
        ],
        "title": "Kimi no Na wa.",
        "synopsis": "Mitsuha Miyamizu, a high school girl, yearns to live the life of a boy in the bustling city of Tokyo—a dream that stands in stark contrast to her present life in the countryside. Meanwhile in the city, Taki Tachibana lives a busy life as a high school student while juggling his part-time job and hopes for a future in architecture. One day, Mitsuha awakens in a room that is not her own and suddenly finds herself living the dream life in Tokyo—but in Taki's body! Elsewhere, Taki finds himself living Mitsuha's life in the humble countryside. In pursuit of an answer to this strange phenomenon, they begin to search for one another. Kimi no Na wa. revolves around Mitsuha and Taki's actions, which begin to have a dramatic impact on each other's lives, weaving them into a fabric held together by fate and circumstance. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "CoMix Wave Films",
        "genres": "Drama",
        "rank": 24,
        "images": "https://cdn.myanimelist.net/images/anime/5/87048l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "48583": {
        "id": "48583",
        "links": [
            "https://animethemes.moe/video/ShingekiNoKyojinS4Part2-OP1.webm",
            "https://animethemes.moe/video/ShingekiNoKyojinS4Part2-ED1.webm"
        ],
        "title": "Shingeki no Kyojin: The Final Season Part 2",
        "synopsis": "Turning against his former allies and enemies alike, Eren Yeager sets a disastrous plan in motion. Under the guidance of the Beast Titan, Zeke, Eren takes extreme measures to end the ancient conflict between Marley and Eldia—but his true intentions remain a mystery. Delving deep into his family's past, Eren fights to control his own destiny. Meanwhile, the long-feuding nations of Marley and Eldia utilize both soldiers and Titans in a brutal race to eliminate the other. Reiner Braun uses his own powers in a desperate bid to hold off Eren's own militaristic force, and his fellow Eldians—children Falco Grice and Gabi Braun—struggle to survive in the unfolding chaos. Elsewhere, Eren's childhood friends Mikasa Ackerman and Armin Arlert remain imprisoned alongside Eren's former Survey Corps companions, all disturbed by Eren's monstrous transformation. Under the blind belief that Eren still secretly harbors good intentions, Mikasa and the others enter the fray in an attempt to save their friend's very soul. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "winter",
        "studios": "MAPPA",
        "genres": "Action",
        "rank": 25,
        "images": "https://cdn.myanimelist.net/images/anime/1948/120625l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "40028": {
        "id": "40028",
        "links": [
            "https://animethemes.moe/video/ShingekiNoKyojinS4-OP1.webm",
            "https://animethemes.moe/video/ShingekiNoKyojinS4-ED1.webm"
        ],
        "title": "Shingeki no Kyojin: The Final Season",
        "synopsis": "Gabi Braun and Falco Grice have been training their entire lives to inherit one of the seven Titans under Marley's control and aid their nation in eradicating the Eldians on Paradis. However, just as all seems well for the two cadets, their peace is suddenly shaken by the arrival of Eren Yeager and the remaining members of the Survey Corps. Having finally reached the Yeager family basement and learned about the dark history surrounding the Titans, the Survey Corps has at long last found the answer they so desperately fought to uncover. With the truth now in their hands, the group set out for the world beyond the walls. In Shingeki no Kyojin: The Final Season, two utterly different worlds collide as each party pursues its own agenda in the long-awaited conclusion to Paradis' fight for freedom. [Written by MAL Rewrite]",
        "year": 2021,
        "season": "winter",
        "studios": "MAPPA",
        "genres": "Action",
        "rank": 26,
        "images": "https://cdn.myanimelist.net/images/anime/1000/110531l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "19": {
        "id": "19",
        "links": [
            "https://animethemes.moe/video/Monster-OP1.webm",
            "https://animethemes.moe/video/Monster-ED1.webm",
            "https://animethemes.moe/video/Monster-ED1v2.webm",
            "https://animethemes.moe/video/Monster-ED1v3.webm",
            "https://animethemes.moe/video/Monster-ED1v4.webm",
            "https://animethemes.moe/video/Monster-ED1v5.webm",
            "https://animethemes.moe/video/Monster-ED2.webm",
            "https://animethemes.moe/video/Monster-ED2v2.webm",
            "https://animethemes.moe/video/Monster-ED2v3.webm",
            "https://animethemes.moe/video/Monster-ED2v4.webm",
            "https://animethemes.moe/video/Monster-ED2v5.webm",
            "https://animethemes.moe/video/Monster-ED2v6.webm"
        ],
        "title": "Monster",
        "synopsis": "Dr. Kenzou Tenma, an elite neurosurgeon recently engaged to his hospital director's daughter, is well on his way to ascending the hospital hierarchy. That is until one night, a seemingly small event changes Dr. Tenma's life forever. While preparing to perform surgery on someone, he gets a call from the hospital director telling him to switch patients and instead perform life-saving brain surgery on a famous performer. His fellow doctors, fiancée, and the hospital director applaud his accomplishment; but because of the switch, a poor immigrant worker is dead, causing Dr. Tenma to have a crisis of conscience. So when a similar situation arises, Dr. Tenma stands his ground and chooses to perform surgery on the young boy Johan Liebert instead of the town's mayor. Unfortunately, this choice leads to serious ramifications for Dr. Tenma—losing his social standing being one of them. However, with the mysterious death of the director and two other doctors, Dr. Tenma's position is restored. With no evidence to convict him, he is released and goes on to attain the position of hospital director. Nine years later when Dr. Tenma saves the life of a criminal, his past comes back to haunt him—once again, he comes face to face with the monster he operated on. He must now embark on a quest of pursuit to make amends for the havoc spread by the one he saved. [Written by MAL Rewrite]",
        "year": 2004,
        "season": "spring",
        "studios": "Madhouse",
        "genres": "Drama",
        "rank": 27,
        "images": "https://cdn.myanimelist.net/images/anime/10/18793l.jpg",
        "rating": "R+ - Mild Nudity"
    },
    "50160": {
        "id": "50160",
        "links": [],
        "title": "Kingdom 4th Season",
        "synopsis": "Following the conclusion of the large-scale coalition campaign, the entirety of China is in a state of economic recovery. The victor of the battle, the state of Qin, is no different. There, the political parties led by Ying Zheng and Buwei Lü continue their inner conflict. Having played the role of king in the coalition battle, Zheng has the trust of the people—but Lü is far from out of the fight. In 18 months, he plans to interrupt Zheng's coming-of-age ceremony. Meanwhile, a Zhao army numbering 20,000 troops has set out toward Qin. In the royal court, due to the lack of generals capable of responding to the incoming threat, Lü slyly suggests that Zheng take command. However, Cheng Jiao, Zheng's half-brother, volunteers instead. As they grew to trust each other during the coalition battle, Zheng now accepts Jiao as his replacement. However, the Zhao forces retreat a mere half-day after clashing with Jiao's army. With trouble quickly brewing in the shadows, the internal struggle of Qin is only complicated further. There are only two men Zheng feels he can rely on: Bi, a general who commands 30,000 men; and Xin, the leader of the Fei Xin force. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "spring"
    },
    "37510": {
        "id": "37510",
        "links": [
            "https://animethemes.moe/video/MobPsycho100S2-OP1.webm",
            "https://animethemes.moe/video/MobPsycho100S2-ED1.webm",
            "https://animethemes.moe/video/MobPsycho100S2-ED2.webm",
            "https://animethemes.moe/video/MobPsycho100S2-ED3.webm",
            "https://animethemes.moe/video/MobPsycho100S2-ED4.webm"
        ],
        "title": "Mob Psycho 100 II",
        "synopsis": "Shigeo \"Mob\" Kageyama is now maturing and understanding his role as a supernatural psychic that has the power to drastically affect the livelihood of others. He and his mentor Reigen Arataka continue to deal with supernatural requests from clients, whether it be exorcizing evil spirits or tackling urban legends that haunt the citizens. While the workflow remains the same, Mob isn't just blindly following Reigen around anymore. With all his experiences as a ridiculously strong psychic, Mob's supernatural adventures now have more weight to them. Things take on a serious and darker tone as the dangers Mob and Reigen face are much more tangible and unsettling than ever before. [Written by MAL Rewrite]",
        "year": 2019,
        "season": "winter",
        "studios": "Bones",
        "genres": "Action",
        "rank": 30,
        "images": "https://cdn.myanimelist.net/images/anime/1918/96303l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "36838": {
        "id": "36838",
        "links": [
            "https://animethemes.moe/video/GintamaShiroganeNoTamashiiHen-OP1.webm",
            "https://animethemes.moe/video/GintamaShiroganeNoTamashiiHen-OP1v2.webm",
            "https://animethemes.moe/video/GintamaShiroganeNoTamashiiHen-OP1v3.webm",
            "https://animethemes.moe/video/GintamaShiroganeNoTamashiiHen-OP1v4.webm",
            "https://animethemes.moe/video/GintamaShiroganeNoTamashiiHen-OP1v5.webm",
            "https://animethemes.moe/video/GintamaShiroganeNoTamashiiHen-ED1.webm",
            "https://animethemes.moe/video/GintamaShiroganeNoTamashiiHen-ED1v2.webm",
            "https://animethemes.moe/video/GintamaShiroganeNoTamashiiHen-ED1v3.webm",
            "https://animethemes.moe/video/GintamaShiroganeNoTamashiiHen-ED1v4.webm"
        ],
        "title": "Gintama.: Shirogane no Tamashii-hen",
        "synopsis": "After the fierce battle on Rakuyou, the untold past and true goal of the immortal Naraku leader, Utsuro, are finally revealed. By corrupting the Altana reserves of several planets, Utsuro has successfully triggered the intervention of the Tendoshuu’s greatest enemy: the Altana Liberation Army. With Earth as the main battleground in this interplanetary war, Utsuro's master plan to destroy the planet—and himself—is nearly complete. An attack on the O-Edo Central Terminal marks the beginning of the final battle to take back the land of the samurai. With the Yorozuya nowhere in sight, the bakufu all but collapsed, and the Shogun missing, the people are left completely helpless as the Liberation Army begins pillaging Edo in the name of freeing them from the Tendoshuu's rule. Caught in the crossfire between two equally imposing forces, can Gintoki, Kagura, Shinpachi, and the former students of Shouyou Yoshida put aside their differences and unite their allies to protect what they hold dear? [Written by MAL Rewrite]",
        "year": 2018,
        "season": "winter",
        "studios": "Bandai Namco Pictures",
        "genres": "Action",
        "rank": 29,
        "images": "https://cdn.myanimelist.net/images/anime/12/89603l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "31758": {
        "id": "31758",
        "links": [
            "https://animethemes.moe/video/Kizumonogatari3-ED1.webm"
        ],
        "title": "Kizumonogatari III: Reiketsu-hen",
        "synopsis": "After helping revive the legendary vampire Kiss-shot Acerola-orion Heart-under-blade, Koyomi Araragi has become a vampire himself and her servant. Kiss-shot is certain she can turn him back into a human, but only once regaining her full power. Araragi has hunted down the three vampire hunters that defeated Kiss-shot and retrieved her limbs to return her to full strength. However, now that Araragi has almost accomplished what he’s been fighting for this whole time, he has to consider if this is what he really wants. Once he revives this powerful immortal vampire, there is no telling what she might do, and there would be no way of stopping her. But there is more to the story that Araragi doesn’t understand. If a newborn vampire like him could defeat the hunters, how did they overpower Kiss-shot? Can he trust her to turn him back to a human? And how is that even possible in the first place? Araragi is at his limit but he must come to a decision, and it may not be possible to resolve this situation without doing something he’ll regret… [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Shaft",
        "genres": "Action",
        "rank": 33,
        "images": "https://cdn.myanimelist.net/images/anime/1084/112813l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "40682": {
        "id": "40682",
        "links": [
            "https://animethemes.moe/video/KingdomS3-OP1.webm",
            "https://animethemes.moe/video/KingdomS3-ED1.webm",
            "https://animethemes.moe/video/KingdomS3-ED1.webm",
            "https://animethemes.moe/video/KingdomS3-ED2.webm"
        ],
        "title": "Kingdom 3rd Season",
        "synopsis": "Following the successful Sanyou campaign, the Qin army, including 1,000-Man Commander Xin, inches ever closer to fulfilling King Ying Zheng's dream of unifying China. With a major geographical foothold in the state of Wei now under its control, Qin sets its sights eastward toward the remaining warring states. Meanwhile Li Mu—an unparalleled strategist and the newly appointed prime minister of the state of Zhao—has taken advantage of Zhao's temporary truce with Qin to negotiate with the other states without interruption. Seemingly without warning, Ying Zheng receives news that armies from the states of Chu, Zhao, Wei, Han, Yan, and Qi have crossed into Qin territory. Realizing too late the purpose behind Li Mu's truce with Qin, Zheng quickly gathers his advisors to devise a plan to address the six-state coalition army on their doorstep. For the first time in history, the state of Qin faces complete destruction and must use every resource and strategy at their disposal to prevent themselves from being wiped off the map. [Written by MAL Rewrite]",
        "year": 2020,
        "season": "spring",
        "studios": "Studio Signpost",
        "genres": "Action",
        "rank": 32,
        "images": "https://cdn.myanimelist.net/images/anime/1443/111830l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "32935": {
        "id": "32935",
        "links": [
            "https://animethemes.moe/video/HaikyuuS3-OP1.webm",
            "https://animethemes.moe/video/HaikyuuS3-ED1.webm"
        ],
        "title": "Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou",
        "synopsis": "After the victory against Aoba Jousai High, Karasuno High School, once called “a fallen powerhouse, a crow that can’t fly,” has finally reached the climax of the heated Spring tournament. Now, to advance to nationals, the Karasuno team has to defeat the powerhouse Shiratorizawa Academy. Karasuno’s greatest hurdle is their adversary’s ace, Wakatoshi Ushijima, the number one player in the Miyagi Prefecture, and one of the country’s top three aces. Only the strongest team will make it to the national tournament. Since this match is the third-year players’ last chance to qualify for nationals, Karasuno has to use everything they learned during the training camp and prior matches to attain victory. Filled with restlessness and excitement, both teams are determined to come out on top in the third season of Haikyuu!!. [Written by MAL Rewrite]",
        "year": 2016,
        "season": "fall",
        "studios": "Production I.G",
        "genres": "Sports",
        "rank": 34,
        "images": "https://cdn.myanimelist.net/images/anime/7/81992l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "17074": {
        "id": "17074",
        "links": [
            "https://animethemes.moe/video/MonogatariSS-OP1.webm",
            "https://animethemes.moe/video/MonogatariSS-OP2.webm",
            "https://animethemes.moe/video/MonogatariSS-OP3.webm",
            "https://animethemes.moe/video/MonogatariSS-OP6.webm",
            "https://animethemes.moe/video/MonogatariSS-ED1v3.webm",
            "https://animethemes.moe/video/MonogatariSS-ED1v2.webm",
            "https://animethemes.moe/video/MonogatariSS-ED2.webm",
            "https://animethemes.moe/video/MonogatariSS-ED2v2.webm",
            "https://animethemes.moe/video/MonogatariSS-ED3.webm",
            "https://animethemes.moe/video/MonogatariSS-OP1.webm",
            "https://animethemes.moe/video/MonogatariSS-OP2.webm",
            "https://animethemes.moe/video/MonogatariSS-OP3.webm",
            "https://animethemes.moe/video/MonogatariSS-OP4.webm",
            "https://animethemes.moe/video/MonogatariSS-OP5.webm",
            "https://animethemes.moe/video/MonogatariSS-OP6.webm",
            "https://animethemes.moe/video/MonogatariSS-ED1.webm",
            "https://animethemes.moe/video/MonogatariSS-ED1v2.webm",
            "https://animethemes.moe/video/MonogatariSS-ED2.webm",
            "https://animethemes.moe/video/MonogatariSS-ED2v2.webm",
            "https://animethemes.moe/video/MonogatariSS-ED3.webm"
        ],
        "title": "Monogatari Series: Second Season",
        "synopsis": "Apparitions, oddities, and gods continue to manifest around Koyomi Araragi and his close-knit group of friends: Tsubasa Hanekawa, the group's modest genius; Shinobu Oshino, the resident doughnut-loving vampire; athletic deviant Suruga Kanbaru; bite-happy spirit Mayoi Hachikuji; Koyomi's cutesy stalker Nadeko Sengoku; and Hitagi Senjogahara, the poignant tsundere. Monogatari Series: Second Season revolves around these individuals and their struggle to overcome the darkness that is rapidly approaching. A new semester has begun and with graduation looming over Araragi, he must quickly decide the paths he will walk, as well as the relationships and friends that he'll save. But as strange events begin to unfold, Araragi is nowhere to be found, and a vicious tiger apparition has appeared in his absence. Hanekawa has become its target, and she must fend for herself—or bow to the creature's perspective on the feebleness of humanity. [Written by MAL Rewrite]",
        "year": 2013,
        "season": "summer",
        "studios": "Shaft",
        "genres": "Comedy",
        "rank": 35,
        "images": "https://cdn.myanimelist.net/images/anime/1807/121534l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "199": {
        "id": "199",
        "links": [
            "https://animethemes.moe/video/SenToChihiroNoKamikakushi-ED1.webm"
        ],
        "title": "Sen to Chihiro no Kamikakushi",
        "synopsis": "Stubborn, spoiled, and naïve, 10-year-old Chihiro Ogino is less than pleased when she and her parents discover an abandoned amusement park on the way to their new house. Cautiously venturing inside, she realizes that there is more to this place than meets the eye, as strange things begin to happen once dusk falls. Ghostly apparitions and food that turns her parents into pigs are just the start—Chihiro has unwittingly crossed over into the spirit world. Now trapped, she must summon the courage to live and work amongst spirits, with the help of the enigmatic Haku and the cast of unique characters she meets along the way. Vivid and intriguing, Sen to Chihiro no Kamikakushi tells the story of Chihiro's journey through an unfamiliar world as she strives to save her parents and return home. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Studio Ghibli",
        "genres": "Adventure",
        "rank": 36,
        "images": "https://cdn.myanimelist.net/images/anime/6/79597l.jpg",
        "rating": "PG - Children"
    },
    "1": {
        "id": "1",
        "links": [
            "https://animethemes.moe/video/CowboyBebop-OP1.webm",
            "https://animethemes.moe/video/CowboyBebop-ED1.webm",
            "https://animethemes.moe/video/CowboyBebop-ED2.webm",
            "https://animethemes.moe/video/CowboyBebop-ED3.webm"
        ],
        "title": "Cowboy Bebop",
        "synopsis": "Crime is timeless. By the year 2071, humanity has expanded across the galaxy, filling the surface of other planets with settlements like those on Earth. These new societies are plagued by murder, drug use, and theft, and intergalactic outlaws are hunted by a growing number of tough bounty hunters. Spike Spiegel and Jet Black pursue criminals throughout space to make a humble living. Beneath his goofy and aloof demeanor, Spike is haunted by the weight of his violent past. Meanwhile, Jet manages his own troubled memories while taking care of Spike and the Bebop, their ship. The duo is joined by the beautiful con artist Faye Valentine, odd child Edward Wong Hau Pepelu Tivrusky IV, and Ein, a bioengineered Welsh Corgi. While developing bonds and working to catch a colorful cast of criminals, the Bebop crew's lives are disrupted by a menace from Spike's past. As a rival's maniacal plot continues to unravel, Spike must choose between life with his newfound family or revenge for his old wounds. [Written by MAL Rewrite]",
        "year": 1998,
        "season": "spring",
        "studios": "Sunrise",
        "genres": "Action",
        "rank": 37,
        "images": "https://cdn.myanimelist.net/images/anime/4/19644l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "33095": {
        "id": "33095",
        "links": [
            "https://animethemes.moe/video/RakugoShinjuS2-OP1.webm",
            "https://animethemes.moe/video/RakugoShinjuS2-OP1v2.webm",
            "https://animethemes.moe/video/RakugoShinjuS2-ED1.webm"
        ],
        "title": "Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen",
        "synopsis": "Even after having risen to the utmost rank of shun'ichi, Yotarou struggles to find his own identity in the world of rakugo. Caught between his master's teachings and the late Sukeroku's unique style, his performance lacks an important ingredient—ego. And while his popularity packs the theaters, he is but one of the few; rakugo is under threat of being eclipsed. Meanwhile Yakumo, regarded by many as the last bastion of preserving the popularity of rakugo, struggles to cope with his elderly state. Even though his performances are still stellar, he fears that he is nearing his limits. His doubts grow stronger as an old friend creeps ever closer. Konatsu, for her part, attempts to raise her son as a single mother, which Yotarou is heavily opposed to. Instead, he seeks to persuade her to marry him and in turn raise her son as his own. In Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen, the curtains fall on Yotarou and Yakumo's story, tasked with restoring the near-obsolete art form as well as overcoming their internal conflicts. [Written by MAL Rewrite]",
        "year": 2017,
        "season": "winter",
        "studios": "Studio Deen",
        "genres": "Drama",
        "rank": 38,
        "images": "https://cdn.myanimelist.net/images/anime/10/82947l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "45576": {
        "id": "45576",
        "links": [
            "https://animethemes.moe/video/MushokuTenseiS2-OP1.webm",
            "https://animethemes.moe/video/MushokuTenseiS2-OP2.webm",
            "https://animethemes.moe/video/MushokuTenseiS2-OP3.webm",
            "https://animethemes.moe/video/MushokuTenseiS2-OP4.webm",
            "https://animethemes.moe/video/MushokuTenseiS2-OP5.webm",
            "https://animethemes.moe/video/MushokuTenseiS2-ED1.webm"
        ],
        "title": "Mushoku Tensei: Isekai Ittara Honki Dasu Part 2",
        "synopsis": "After the mysterious mana calamity, Rudeus Greyrat and his fierce student Eris Boreas Greyrat are teleported to the Demon Continent. There, they team up with their newfound companion Ruijerd Supardia—the former leader of the Superd's Warrior group—to form \"Dead End,\" a successful adventurer party. Making a name for themselves, the trio journeys across the continent to make their way back home to Fittoa. Following the advice he received from the faceless god Hitogami, Rudeus saves Kishirika Kishirisu, the Great Emperor of the Demon World, who rewards him by granting him a strange power. Now, as Rudeus masters the powerful ability that offers a number of new opportunities, it might prove to be more than what he bargained for when unexpected dangers threaten to hinder their travels. [Written by MAL Rewrite]",
        "year": 2021,
        "season": "fall",
        "studios": "Studio Bind",
        "genres": "Drama",
        "rank": 40,
        "images": "https://cdn.myanimelist.net/images/anime/1028/117777l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "46102": {
        "id": "46102",
        "links": [
            "https://animethemes.moe/video/OddTaxi-OP1.webm",
            "https://animethemes.moe/video/OddTaxi-ED1.webm",
            "https://animethemes.moe/video/OddTaxi-ED2.webm"
        ],
        "title": "Odd Taxi",
        "synopsis": "Eccentric and blunt, the walrus Hiroshi Odokawa lives a relatively normal life. He drives a taxi for a living, and there he meets several unique individuals: the jobless Taichi Kabasawa who is dead-set on going viral, the mysterious nurse Miho Shirakawa, the struggling comedic duo \"Homo Sapiens,\" and Dobu, a well-known delinquent. But Odokawa's simple way of life is about to be turned upside-down. The case of a missing girl the police have been tracking leads back to him, and now both the yakuza and a duo of corrupt cops are on his tail. Set in a strangely familiar city filled with unusual individuals, Odd Taxi is a bizarre story about a humble taxi driver and the mystery of a lost high schooler. [Written by MAL Rewrite]",
        "year": 2021,
        "season": "spring",
        "studios": "OLM",
        "genres": "Mystery",
        "rank": 41,
        "images": "https://cdn.myanimelist.net/images/anime/1981/113348l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "263": {
        "id": "263",
        "links": [
            "https://animethemes.moe/video/HajimeNoIppo-OP1.webm",
            "https://animethemes.moe/video/HajimeNoIppo-OP2.webm",
            "https://animethemes.moe/video/HajimeNoIppo-OP3.webm",
            "https://animethemes.moe/video/HajimeNoIppo-ED1.webm",
            "https://animethemes.moe/video/HajimeNoIppo-ED2.webm",
            "https://animethemes.moe/video/HajimeNoIppo-ED3.webm",
            "https://animethemes.moe/video/HajimeNoIppo-ED3v2.webm"
        ],
        "title": "Hajime no Ippo",
        "synopsis": "In his father's absence, teenager Ippo Makunouchi works hard to help his mother run her fishing boat rental business. Ippo's timid nature, his lack of sleep, and the sea smell make him an easy target for relentless bullies who leave him bruised and beaten on a daily basis. Mamoru Takamura, an up-and-coming boxer, rescues Ippo from a violent after-school incident and takes him back to the Kamogawa Boxing Gym for recovery. Takamura and his fellow boxers, Masaru Aoki and Tatsuya Kimura, are stunned by Ippo's powerful punches—a result of strong muscles developed through years serving his physically taxing family business. Following brief training under Takamura, Ippo impresses the other boxers in a practice match against prodigy Ichirou Miyata. He gains a rival in Miyata and a coach in Genji Kamogawa, the gym owner and a former boxer himself. As Ippo takes the first steps in his official boxing career, he faces off against a series of challenging opponents, each more powerful than the last. Victory, loss, and a cycle of dedicated training await Ippo on his journey to achieve greatness. With his tough body and unstoppable fighting spirit, the kind young man seeks to take on the world. [Written by MAL Rewrite]",
        "year": 2000,
        "season": "fall",
        "studios": "Madhouse",
        "genres": "Sports",
        "rank": 42,
        "images": "https://cdn.myanimelist.net/images/anime/4/86334l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "37521": {
        "id": "37521",
        "links": [
            "https://animethemes.moe/video/VinlandSaga-OP1.webm",
            "https://animethemes.moe/video/VinlandSaga-OP2.webm",
            "https://animethemes.moe/video/VinlandSaga-ED1.webm",
            "https://animethemes.moe/video/VinlandSaga-ED2.webm"
        ],
        "title": "Vinland Saga",
        "synopsis": "Young Thorfinn grew up listening to the stories of old sailors that had traveled the ocean and reached the place of legend, Vinland. It's said to be warm and fertile, a place where there would be no need for fighting—not at all like the frozen village in Iceland where he was born, and certainly not like his current life as a mercenary. War is his home now. Though his father once told him, \"You have no enemies, nobody does. There is nobody who it's okay to hurt,\" as he grew, Thorfinn knew that nothing was further from the truth. The war between England and the Danes grows worse with each passing year. Death has become commonplace, and the viking mercenaries are loving every moment of it. Allying with either side will cause a massive swing in the balance of power, and the vikings are happy to make names for themselves and take any spoils they earn along the way. Among the chaos, Thorfinn must take his revenge and kill Askeladd, the man who murdered his father. The only paradise for the vikings, it seems, is the era of war and death that rages on. [Written by MAL Rewrite]",
        "year": 2019,
        "season": "summer",
        "studios": "Wit Studio",
        "genres": "Action",
        "rank": 43,
        "images": "https://cdn.myanimelist.net/images/anime/1500/103005l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "48569": {
        "id": "48569",
        "links": [
            "https://animethemes.moe/video/86S2-OP1.webm",
            "https://animethemes.moe/video/86S2-ED1.webm"
        ],
        "title": "86 Part 2",
        "synopsis": "The disappearance of the Spearhead Squadron beyond the horizon does little to hide the intensity of the Republic of San Magnolia's endless propaganda. Vladilena Milizé continues to operate as \"Handler One,\" the commander of yet another dehumanized 86th faction's squadron in the continuous war against the Legion. On the Western Front, Shinei Nouzen and his squad are quarantined in a military base controlled by the Federal Republic of Giad, formerly known as the Giadian Empire. The newly-established government grants the saved Eighty-Six full citizenship and freedom. Housed by the president Ernst Zimmerman himself, the group meets his adoptive daughter and the last Empress, Augusta Frederica Adel-Adler. However, within the calm of this tender society, Shinei and his team feel that their purpose is on the battlefield. Before long, they are once again in the midst of the Legion's onslaught as a part of the Federacy's Nordlicht Squadron, accompanied by Augusta Frederica. But, as history repeats itself, they realize that no matter the side, death and pain on the front lines are the only comfort they know. [Written by MAL Rewrite]",
        "year": 2021,
        "season": "fall",
        "studios": "A-1 Pictures",
        "genres": "Action",
        "rank": 44,
        "images": "https://cdn.myanimelist.net/images/anime/1321/117508l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "2921": {
        "id": "2921",
        "links": [
            "https://animethemes.moe/video/AshitaNoJoe2-OP1.webm",
            "https://animethemes.moe/video/AshitaNoJoe2-OP2.webm",
            "https://animethemes.moe/video/AshitaNoJoe2-ED1.webm",
            "https://animethemes.moe/video/AshitaNoJoe2-ED2.webm"
        ],
        "title": "Ashita no Joe 2",
        "synopsis": "Yabuki Joe is left downhearted and hopeless after a certain tragic event. In attempt to put the past behind him, Joe leaves the gym behind and begins wandering. On his travels he comes across the likes of Wolf Kanagushi and Goromaki Gondo, men who unintentionally fan the dying embers inside him, leading him to putting his wanderings to an end. His return home puts Joe back on the path to boxing, but unknown to himself and his trainer, he now suffers deep-set issues holding him back from fighting. In attempt to quell those issues, Carlos Rivera, a world renowned boxer is invited from Venezuela to help Joe recover.",
        "year": 1980,
        "season": "fall",
        "studios": "Tokyo Movie Shinsha",
        "genres": "Action",
        "rank": 45,
        "images": "https://cdn.myanimelist.net/images/anime/3/45028l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "33050": {
        "id": "33050",
        "links": [
            "https://animethemes.moe/video/FateStayNightHeavensFeelSpringSong-ED1.webm"
        ],
        "title": "Fate/stay night Movie: Heaven's Feel - III. Spring Song",
        "synopsis": "The Fifth Holy Grail War in Fuyuki City has reached a turning point in which the lives of all participants are threatened as the hidden enemy finally reveals itself. As Shirou Emiya, Rin Toosaka, and Illyasviel von Einzbern discover the true, corruptive nature of the shadow that has been rampaging throughout the city, they realize just how dire the situation is. In order to protect their beloved ones, the group must hold their own against the seemingly insurmountable enemy force—even if some of those foes were once their allies, or perhaps, something more intimate. As the final act of this chaotic war commences, the ideals Shirou believes will soon be challenged by an excruciating dilemma: is it really possible to save a world where everything seems to have gone wrong? [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "ufotable",
        "genres": "Action",
        "rank": 48,
        "images": "https://cdn.myanimelist.net/images/anime/1142/112957l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "21939": {
        "id": "21939",
        "links": [
            "https://animethemes.moe/video/MushishiZokuShou-OP1.webm"
        ],
        "title": "Mushishi Zoku Shou",
        "synopsis": "Perceived as strange and feared by man, over time the misshapen ones came to be known as Mushi. Although they harbor no ill intentions towards humans, many suffer from the side effects of their existence and strange nature; exploiting the Mushi without understanding them, even unintentionally, can lead to disaster and strife for any involved. Mushishi Zoku Shou continues the story of Mushishi Ginko on his journey to help the visible world to coexist with the Mushi. During his travels, Ginko discovers various gifted individuals—those cursed by circumstance and those maintaining a fragile symbiosis with the Mushi—inevitably confronting the question of whether humanity, talented and tortured alike, can manage the responsibility of the unseen. Moreover, as a Mushishi, Ginko must learn more about these strange beings and decide if he has the right to interfere with the complex relationships between Mushi and mankind. [Written by MAL Rewrite]",
        "year": 2014,
        "season": "spring",
        "studios": "Artland",
        "genres": "Adventure",
        "rank": 47,
        "images": "https://cdn.myanimelist.net/images/anime/13/58533l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "1575": {
        "id": "1575",
        "links": [
            "https://animethemes.moe/video/CodeGeass-OP1.webm",
            "https://animethemes.moe/video/CodeGeass-OP1v2.webm",
            "https://animethemes.moe/video/CodeGeass-OP2.webm",
            "https://animethemes.moe/video/CodeGeass-OP2v2.webm",
            "https://animethemes.moe/video/CodeGeass-OP3.webm",
            "https://animethemes.moe/video/CodeGeass-ED1.webm",
            "https://animethemes.moe/video/CodeGeass-ED2.webm"
        ],
        "title": "Code Geass: Hangyaku no Lelouch",
        "synopsis": "In the year 2010, the Holy Empire of Britannia is establishing itself as a dominant military nation, starting with the conquest of Japan. Renamed to Area 11 after its swift defeat, Japan has seen significant resistance against these tyrants in an attempt to regain independence. Lelouch Lamperouge, a Britannian student, unfortunately finds himself caught in a crossfire between the Britannian and the Area 11 rebel armed forces. He is able to escape, however, thanks to the timely appearance of a mysterious girl named C.C., who bestows upon him Geass, the \"Power of Kings.\" Realizing the vast potential of his newfound \"power of absolute obedience,\" Lelouch embarks upon a perilous journey as the masked vigilante known as Zero, leading a merciless onslaught against Britannia in order to get revenge once and for all. [Written by MAL Rewrite]",
        "year": 2006,
        "season": "fall",
        "studios": "Sunrise",
        "genres": "Action",
        "rank": 50,
        "images": "https://cdn.myanimelist.net/images/anime/5/50331l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "245": {
        "id": "245",
        "links": [
            "https://animethemes.moe/video/GreatTeacherOnizuka-OP1.webm",
            "https://animethemes.moe/video/GreatTeacherOnizuka-OP2.webm",
            "https://animethemes.moe/video/GreatTeacherOnizuka-ED1.webm",
            "https://animethemes.moe/video/GreatTeacherOnizuka-ED2.webm",
            "https://animethemes.moe/video/GreatTeacherOnizuka-ED3.webm"
        ],
        "title": "Great Teacher Onizuka",
        "synopsis": "Twenty-two-year-old Eikichi Onizuka—ex-biker gang leader, conqueror of Shonan, and virgin—has a dream: to become the greatest high school teacher in all of Japan. This isn't because of a passion for teaching, but because he wants a loving teenage wife when he's old and gray. Still, for a perverted, greedy, and lazy delinquent, there is more to Onizuka than meets the eye. So when he lands a job as the homeroom teacher of the Class 3-4 at the prestigious Holy Forest Academy—despite suplexing the Vice Principal—all of his talents are put to the test, as this class is particularly infamous. Due to their utter contempt for all teachers, the class' students use psychological warfare to mentally break any new homeroom teacher they get, forcing them to quit and leave school. However, Onizuka isn't your average teacher, and he's ready for any challenge in his way. Bullying, suicide, and sexual harassment are just a few of the issues his students face daily. By tackling the roots of their problems, Onizuka supports them with his unpredictable and unconventional methods—even if it means jumping off a building to save a suicidal child. Thanks to his eccentric charm and fun-loving nature, Class 3-4 slowly learns just how enjoyable school can be when you're the pupils of the Great Teacher Onizuka. [Written by MAL Rewrite]",
        "year": 1999,
        "season": "summer",
        "studios": "Studio Pierrot",
        "genres": "Comedy",
        "rank": 51,
        "images": "https://cdn.myanimelist.net/images/anime/13/11460l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "40748": {
        "id": "40748",
        "links": [
            "https://animethemes.moe/video/JujutsuKaisen-OP1.webm",
            "https://animethemes.moe/video/JujutsuKaisen-OP1v2.webm",
            "https://animethemes.moe/video/JujutsuKaisen-OP1v3.webm",
            "https://animethemes.moe/video/JujutsuKaisen-OP1v4.webm",
            "https://animethemes.moe/video/JujutsuKaisen-OP2.webm",
            "https://animethemes.moe/video/JujutsuKaisen-ED1.webm",
            "https://animethemes.moe/video/JujutsuKaisen-ED2.webm"
        ],
        "title": "Jujutsu Kaisen (TV)",
        "synopsis": "Idly indulging in baseless paranormal activities with the Occult Club, high schooler Yuuji Itadori spends his days at either the clubroom or the hospital, where he visits his bedridden grandfather. However, this leisurely lifestyle soon takes a turn for the strange when he unknowingly encounters a cursed item. Triggering a chain of supernatural occurrences, Yuuji finds himself suddenly thrust into the world of Curses—dreadful beings formed from human malice and negativity—after swallowing the said item, revealed to be a finger belonging to the demon Sukuna Ryoumen, the \"King of Curses.\" Yuuji experiences first-hand the threat these Curses pose to society as he discovers his own newfound powers. Introduced to the Tokyo Metropolitan Jujutsu Technical High School, he begins to walk down a path from which he cannot return—the path of a Jujutsu sorcerer. [Written by MAL Rewrite]",
        "year": 2020,
        "season": "fall",
        "studios": "MAPPA",
        "genres": "Action",
        "rank": 52,
        "images": "https://cdn.myanimelist.net/images/anime/1171/109222l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "34599": {
        "id": "34599",
        "links": [
            "https://animethemes.moe/video/MadeInAbyss-OP1.webm",
            "https://animethemes.moe/video/MadeInAbyss-OP2.webm",
            "https://animethemes.moe/video/MadeInAbyss-OP2v2.webm",
            "https://animethemes.moe/video/MadeInAbyss-OP2v3.webm",
            "https://animethemes.moe/video/MadeInAbyss-OP2v4.webm",
            "https://animethemes.moe/video/MadeInAbyss-ED1.webm",
            "https://animethemes.moe/video/MadeInAbyss-ED1v2.webm",
            "https://animethemes.moe/video/MadeInAbyss-ED2.webm",
            "https://animethemes.moe/video/MadeInAbyss-ED3.webm"
        ],
        "title": "Made in Abyss",
        "synopsis": "The Abyss—a gaping chasm stretching down into the depths of the earth, filled with mysterious creatures and relics from a time long past. How did it come to be? What lies at the bottom? Countless brave individuals, known as Divers, have sought to solve these mysteries of the Abyss, fearlessly descending into its darkest realms. The best and bravest of the Divers, the White Whistles, are hailed as legends by those who remain on the surface. Riko, daughter of the missing White Whistle Lyza the Annihilator, aspires to become like her mother and explore the furthest reaches of the Abyss. However, just a novice Red Whistle herself, she is only permitted to roam its most upper layer. Even so, Riko has a chance encounter with a mysterious robot with the appearance of an ordinary young boy. She comes to name him Reg, and he has no recollection of the events preceding his discovery. Certain that the technology to create Reg must come from deep within the Abyss, the two decide to venture forth into the chasm to recover his memories and see the bottom of the great pit with their own eyes. However, they know not of the harsh reality that is the true existence of the Abyss. [Written by MAL Rewrite]",
        "year": 2017,
        "season": "summer",
        "studios": "Kinema Citrus",
        "genres": "Adventure",
        "rank": 53,
        "images": "https://cdn.myanimelist.net/images/anime/6/86733l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "36862": {
        "id": "36862",
        "links": [
            "https://animethemes.moe/video/MadeInAbyssMovie-OP1.webm",
            "https://animethemes.moe/video/MadeInAbyssMovie-ED1.webm"
        ],
        "title": "Made in Abyss Movie 3: Fukaki Tamashii no Reimei",
        "synopsis": "Continuing their perilous descent down the Abyss, Riko, Regu, and newfound friend Nanachi reach the Abyss' fifth layer, The Sea of Corpses. Upon arriving at the research station known as Idofront, the main trio encounter the mysterious Prushka, the alleged daughter of Bondrewd, who leads them to the White Whistle responsible for Nanachi's dark past. Despite the welcoming appearances of Idofront's residents, Nanachi warns the young adventurers that things are not always what they seem. With the only route to the sixth layer shrouded in mystery and Bonedrewd's schemes awaiting them, what sacrifices must be made in order to continue the journey down to the bottom of the Abyss? [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Kinema Citrus",
        "genres": "Adventure",
        "rank": 54,
        "images": "https://cdn.myanimelist.net/images/anime/1502/110723l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "164": {
        "id": "164",
        "links": [
            "https://animethemes.moe/video/MononokeHime-ED1.webm",
            "https://animethemes.moe/video/MononokeHimeDub-ED1.webm"
        ],
        "title": "Mononoke Hime",
        "synopsis": "When an Emishi village is attacked by a fierce demon boar, the young prince Ashitaka puts his life at stake to defend his tribe. With its dying breath, the beast curses the prince's arm, granting him demonic powers while gradually siphoning his life away. Instructed by the village elders to travel westward for a cure, Ashitaka arrives at Tatara, the Iron Town, where he finds himself embroiled in a fierce conflict: Lady Eboshi of Tatara, promoting constant deforestation, stands against Princess San and the sacred spirits of the forest, who are furious at the destruction brought by the humans. As the opposing forces of nature and mankind begin to clash in a desperate struggle for survival, Ashitaka attempts to seek harmony between the two, all the while battling the latent demon inside of him. Princess Mononoke is a tale depicting the connection of technology and nature, while showing the path to harmony that could be achieved by mutual acceptance. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Studio Ghibli",
        "genres": "Action",
        "rank": 55,
        "images": "https://cdn.myanimelist.net/images/anime/7/75919l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "457": {
        "id": "457",
        "links": [
            "https://animethemes.moe/video/Mushishi-OP1.webm"
        ],
        "title": "Mushishi",
        "synopsis": "\"Mushi\": the most basic forms of life in the world. They exist without any goals or purposes aside from simply \"being.\" They are beyond the shackles of the words \"good\" and \"evil.\" Mushi can exist in countless forms and are capable of mimicking things from the natural world such as plants, diseases, and even phenomena like rainbows. This is, however, just a vague definition of these entities that inhabit the vibrant world of Mushishi, as to even call them a form of life would be an oversimplification. Detailed information on Mushi is scarce because the majority of humans are unaware of their existence. So what are Mushi and why do they exist? This is the question that a \"Mushishi,\" Ginko, ponders constantly. Mushishi are those who research Mushi in hopes of understanding their place in the world's hierarchy of life. Ginko chases rumors of occurrences that could be tied to Mushi, all for the sake of finding an answer. It could, after all, lead to the meaning of life itself. [Written by MAL Rewrite]",
        "year": 2005,
        "season": "fall",
        "studios": "Artland",
        "genres": "Adventure",
        "rank": 56,
        "images": "https://cdn.myanimelist.net/images/anime/2/73862l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "23273": {
        "id": "23273",
        "links": [
            "https://animethemes.moe/video/KimiUso-OP1.webm",
            "https://animethemes.moe/video/KimiUso-OP2.webm",
            "https://animethemes.moe/video/KimiUso-OP2v2.webm",
            "https://animethemes.moe/video/KimiUso-ED1.webm",
            "https://animethemes.moe/video/KimiUso-ED2.webm",
            "https://animethemes.moe/video/KimiUso-ED3.webm"
        ],
        "title": "Shigatsu wa Kimi no Uso",
        "synopsis": "Kousei Arima is a child prodigy known as the \"Human Metronome\" for playing the piano with precision and perfection. Guided by a strict mother and rigorous training, Kousei dominates every competition he enters, earning the admiration of his musical peers and praise from audiences. When his mother suddenly passes away, the subsequent trauma makes him unable to hear the sound of a piano, and he never takes the stage thereafter. Nowadays, Kousei lives a quiet and unassuming life as a junior high school student alongside his friends Tsubaki Sawabe and Ryouta Watari. While struggling to get over his mother's death, he continues to cling to music. His monochrome life turns upside down the day he encounters the eccentric violinist Kaori Miyazono, who thrusts him back into the spotlight as her accompanist. Through a little lie, these two young musicians grow closer together as Kaori tries to fill Kousei's world with color. [Written by MAL Rewrite]",
        "year": 2014,
        "season": "fall",
        "studios": "A-1 Pictures",
        "genres": "Drama",
        "rank": 57,
        "images": "https://cdn.myanimelist.net/images/anime/3/67177l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "33352": {
        "id": "33352",
        "links": [
            "https://animethemes.moe/video/VioletEvergarden-OP1.webm",
            "https://animethemes.moe/video/VioletEvergarden-ED1v2.webm",
            "https://animethemes.moe/video/VioletEvergarden-ED1.webm",
            "https://animethemes.moe/video/VioletEvergarden-ED1v3.webm",
            "https://animethemes.moe/video/VioletEvergarden-ED1v4.webm",
            "https://animethemes.moe/video/VioletEvergarden-ED2.webm"
        ],
        "title": "Violet Evergarden",
        "synopsis": "The Great War finally came to an end after four long years of conflict; fractured in two, the continent of Telesis slowly began to flourish once again. Caught up in the bloodshed was Violet Evergarden, a young girl raised for the sole purpose of decimating enemy lines. Hospitalized and maimed in a bloody skirmish during the War's final leg, she was left with only words from the person she held dearest, but with no understanding of their meaning. Recovering from her wounds, Violet starts a new life working at CH Postal Services after a falling out with her new intended guardian family. There, she witnesses by pure chance the work of an \"Auto Memory Doll,\" amanuenses that transcribe people's thoughts and feelings into words on paper. Moved by the notion, Violet begins work as an Auto Memory Doll, a trade that will take her on an adventure, one that will reshape the lives of her clients and hopefully lead to self-discovery. [Written by MAL Rewrite]",
        "year": 2018,
        "season": "winter",
        "studios": "Kyoto Animation",
        "genres": "Drama",
        "rank": 58,
        "images": "https://cdn.myanimelist.net/images/anime/1795/95088l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "40456": {
        "id": "40456",
        "links": [
            "https://animethemes.moe/video/KimetsuNoYaibaMugenRessha-ED1.webm"
        ],
        "title": "Kimetsu no Yaiba Movie: Mugen Ressha-hen",
        "synopsis": "After a string of mysterious disappearances begin to plague a train, the Demon Slayer Corps' multiple attempts to remedy the problem prove fruitless. To prevent further casualties, the Flame Pillar, Kyoujurou Rengoku, takes it upon himself to eliminate the threat. Accompanying him are some of the Corps' most promising new blood: Tanjirou Kamado, Zenitsu Agatsuma, and Inosuke Hashibira, who all hope to witness the fiery feats of this model demon slayer firsthand. Unbeknownst to them, the demonic forces responsible for the disappearances have already put their sinister plan in motion. Under this demonic presence, the group must muster every ounce of their willpower and draw their swords to save all two hundred passengers onboard. Kimetsu no Yaiba Movie: Mugen Ressha-hen delves into the deepest corners of Tanjirou's mind, putting his resolve and commitment to duty to the test. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "ufotable",
        "genres": "Action",
        "rank": 59,
        "images": "https://cdn.myanimelist.net/images/anime/1704/106947l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "5258": {
        "id": "5258",
        "links": [
            "https://animethemes.moe/video/HajimeNoIppoNewChallenger-OP1.webm",
            "https://animethemes.moe/video/HajimeNoIppoNewChallenger-ED1.webm"
        ],
        "title": "Hajime no Ippo: New Challenger",
        "synopsis": "Japanese Featherweight Champion Ippo Makunouchi has successfully defended and retained his title. Meanwhile, his rival, Ichirou Miyata, has resurfaced in Japan, aiming for his own Featherweight belt in the Oriental Pacific Boxing Federation. When the rest of the world comes knocking, however, will Japan's best fighters rise to the challenge and achieve glory at the top? Or will the small island nation be crushed under the weight of greater entities? This time, champions will become challengers issuing a call to the rest of the world and ready to show off their fighting spirit! [Written by MAL Rewrite]",
        "year": 2009,
        "season": "winter",
        "studios": "Madhouse",
        "genres": "Sports",
        "rank": 60,
        "images": "https://cdn.myanimelist.net/images/anime/8/56617l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "28891": {
        "id": "28891",
        "links": [
            "https://animethemes.moe/video/HaikyuuS2-OP1.webm",
            "https://animethemes.moe/video/HaikyuuS2-OP2.webm",
            "https://animethemes.moe/video/HaikyuuS2-ED1.webm",
            "https://animethemes.moe/video/HaikyuuS2-ED2.webm"
        ],
        "title": "Haikyuu!! Second Season",
        "synopsis": "Following their participation at the Inter-High, the Karasuno High School volleyball team attempts to refocus their efforts, aiming to conquer the Spring tournament instead. When they receive an invitation from long-standing rival Nekoma High, Karasuno agrees to take part in a large training camp alongside many notable volleyball teams in Tokyo and even some national level players. By playing with some of the toughest teams in Japan, they hope not only to sharpen their skills, but also come up with new attacks that would strengthen them. Moreover, Hinata and Kageyama attempt to devise a more powerful weapon, one that could possibly break the sturdiest of blocks. Facing what may be their last chance at victory before the senior players graduate, the members of Karasuno's volleyball team must learn to settle their differences and train harder than ever if they hope to overcome formidable opponents old and new—including their archrival Aoba Jousai and its world-class setter Tooru Oikawa. [Written by MAL Rewrite]",
        "year": 2015,
        "season": "fall",
        "studios": "Production I.G",
        "genres": "Sports",
        "rank": 62,
        "images": "https://cdn.myanimelist.net/images/anime/9/76662l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "40591": {
        "id": "40591",
        "links": [
            "https://animethemes.moe/video/KaguyaSamaWaKokurasetaiS2-OP1.webm",
            "https://animethemes.moe/video/KaguyaSamaWaKokurasetaiS2-ED1.webm",
            "https://animethemes.moe/video/KaguyaSamaWaKokurasetaiS2-ED1v2.webm",
            "https://animethemes.moe/video/KaguyaSamaWaKokurasetaiS2-ED1v3.webm",
            "https://animethemes.moe/video/KaguyaSamaWaKokurasetaiS2-ED1v4.webm"
        ],
        "title": "Kaguya-sama wa Kokurasetai? Tensai-tachi no Renai Zunousen",
        "synopsis": "After a slow but eventful summer vacation, Shuchiin Academy's second term is now starting in full force. As August transitions into September, Miyuki Shirogane's birthday looms ever closer, leaving Kaguya Shinomiya in a serious predicament as to how to celebrate it. Furthermore, the tenure of the school's 67th student council is coming to an end. Due to the council members being in different classes, the only time Kaguya and Miyuki have to be together will soon disappear, putting all of their cunning plans at risk. A long and difficult election that will decide the fate of the new student council awaits, as multiple challengers fight for the coveted title of president. [Written by MAL Rewrite]",
        "year": 2020,
        "season": "spring",
        "studios": "A-1 Pictures",
        "genres": "Comedy",
        "rank": 63,
        "images": "https://cdn.myanimelist.net/images/anime/1764/106659l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "11665": {
        "id": "11665",
        "links": [
            "https://animethemes.moe/video/NatsumeYuujinchouShi-OP1.webm",
            "https://animethemes.moe/video/NatsumeYuujinchouShi-ED1.webm"
        ],
        "title": "Natsume Yuujinchou Shi",
        "synopsis": "Takashi Natsume, the timid youkai expert and master of the Book of Friends, continues his journey towards self-understanding and acceptance with the help of friends both new and old. His most important ally is still his gluttonous and sake-loving bodyguard, the arrogant but fiercely protective wolf spirit Madara—or Nyanko-sensei, as Madara is called when in his usual disguise of an unassuming, pudgy cat. Natsume, while briefly separated from Nyanko-sensei, is ambushed and kidnapped by a strange group of masked, monkey-like youkai, who have spirited him away to their forest as they desperately search for the Book of Friends. Realizing that his \"servant\" has been taken out from right under his nose, Nyanko-sensei enlists the help of Natsume's youkai friends and mounts a rescue operation. However, the forest of the monkey spirits holds many dangerous enemies, including the Matoba Clan, Natsume's old nemesis. Stretching from the formidable hideout of the Matoba to Natsume's own childhood home, Natsume Yuujinchou Shi is a sweeping but familiar return to a world of danger and friendship, where Natsume will finally confront the demons of his own past. [Written by MAL Rewrite]",
        "year": 2012,
        "season": "winter",
        "studios": "Brain's Base",
        "genres": "Drama",
        "rank": 64,
        "images": "https://cdn.myanimelist.net/images/anime/3/37449l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "21": {
        "id": "21",
        "links": [
            "https://animethemes.moe/video/OnePiece-OP1.webm",
            "https://animethemes.moe/video/OnePiece-OP2.webm",
            "https://animethemes.moe/video/OnePiece-OP3.webm",
            "https://animethemes.moe/video/OnePiece-OP4.webm",
            "https://animethemes.moe/video/OnePiece-OP5.webm",
            "https://animethemes.moe/video/OnePiece-OP6.webm",
            "https://animethemes.moe/video/OnePiece-OP7.webm",
            "https://animethemes.moe/video/OnePiece-OP8.webm",
            "https://animethemes.moe/video/OnePiece-OP9.webm",
            "https://animethemes.moe/video/OnePiece-OP10.webm",
            "https://animethemes.moe/video/OnePiece-OP11.webm",
            "https://animethemes.moe/video/OnePiece-OP12.webm",
            "https://animethemes.moe/video/OnePiece-OP13.webm",
            "https://animethemes.moe/video/OnePiece-OP14.webm",
            "https://animethemes.moe/video/OnePiece-OP15.webm",
            "https://animethemes.moe/video/OnePiece-OP16.webm",
            "https://animethemes.moe/video/OnePiece-OP17.webm",
            "https://animethemes.moe/video/OnePiece-OP18.webm",
            "https://animethemes.moe/video/OnePiece-OP19.webm",
            "https://animethemes.moe/video/OnePiece-OP20.webm",
            "https://animethemes.moe/video/OnePiece-OP21.webm",
            "https://animethemes.moe/video/OnePiece-OP22.webm",
            "https://animethemes.moe/video/OnePiece-OP23.webm",
            "https://animethemes.moe/video/OnePiece-ED1.webm",
            "https://animethemes.moe/video/OnePiece-ED2.webm",
            "https://animethemes.moe/video/OnePiece-ED3.webm",
            "https://animethemes.moe/video/OnePiece-ED4.webm",
            "https://animethemes.moe/video/OnePiece-ED5.webm",
            "https://animethemes.moe/video/OnePiece-ED6.webm",
            "https://animethemes.moe/video/OnePiece-ED7.webm",
            "https://animethemes.moe/video/OnePiece-ED8.webm",
            "https://animethemes.moe/video/OnePiece-ED9.webm",
            "https://animethemes.moe/video/OnePiece-ED10.webm",
            "https://animethemes.moe/video/OnePiece-ED11.webm",
            "https://animethemes.moe/video/OnePiece-ED12.webm",
            "https://animethemes.moe/video/OnePiece-ED13.webm",
            "https://animethemes.moe/video/OnePiece-ED14.webm",
            "https://animethemes.moe/video/OnePiece-ED15.webm",
            "https://animethemes.moe/video/OnePiece-ED16.webm",
            "https://animethemes.moe/video/OnePiece-ED17.webm",
            "https://animethemes.moe/video/OnePiece-ED18.webm",
            "https://animethemes.moe/video/OnePiece-ED19.webm",
            "https://animethemes.moe/video/OnePiece-ED20.webm",
            "https://animethemes.moe/video/OnePiece-ED21.webm",
            "https://animethemes.moe/video/OnePieceDub-OP1.webm",
            "https://animethemes.moe/video/OnePieceDub-OP2.webm",
            "https://animethemes.moe/video/OnePieceDub-OP3.webm",
            "https://animethemes.moe/video/OnePieceDub-OP4.webm",
            "https://animethemes.moe/video/OnePieceDub-ED1.webm",
            "https://animethemes.moe/video/OnePieceDub-ED2.webm",
            "https://animethemes.moe/video/OnePieceDub-ED3.webm",
            "https://animethemes.moe/video/OnePieceDub-ED4.webm",
            "https://animethemes.moe/video/OnePieceDub-ED5.webm",
            "https://animethemes.moe/video/OnePieceDub-ED6.webm",
            "https://animethemes.moe/video/OnePieceDub-ED7.webm",
            "https://animethemes.moe/video/OnePieceDub-ED8.webm",
            "https://animethemes.moe/video/OnePieceDub-ED9.webm",
            "https://animethemes.moe/video/OnePieceDub-ED10.webm",
            "https://animethemes.moe/video/OnePieceDub-ED11.webm",
            "https://animethemes.moe/video/OnePieceDub-ED12.webm",
            "https://animethemes.moe/video/OnePieceDub-ED12.webm"
        ],
        "title": "One Piece",
        "synopsis": "Gol D. Roger was known as the \"Pirate King,\" the strongest and most infamous being to have sailed the Grand Line. The capture and execution of Roger by the World Government brought a change throughout the world. His last words before his death revealed the existence of the greatest treasure in the world, One Piece. It was this revelation that brought about the Grand Age of Pirates, men who dreamed of finding One Piece—which promises an unlimited amount of riches and fame—and quite possibly the pinnacle of glory and the title of the Pirate King. Enter Monkey D. Luffy, a 17-year-old boy who defies your standard definition of a pirate. Rather than the popular persona of a wicked, hardened, toothless pirate ransacking villages for fun, Luffy's reason for being a pirate is one of pure wonder: the thought of an exciting adventure that leads him to intriguing people and ultimately, the promised treasure. Following in the footsteps of his childhood hero, Luffy and his crew travel across the Grand Line, experiencing crazy adventures, unveiling dark mysteries and battling strong enemies, all in order to reach the most coveted of all fortunes—One Piece. [Written by MAL Rewrite]",
        "year": 1999,
        "season": "fall",
        "studios": "Toei Animation",
        "genres": "Action",
        "rank": 65,
        "images": "https://cdn.myanimelist.net/images/anime/6/73245l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "40834": {
        "id": "40834",
        "links": [
            "https://animethemes.moe/video/OusamaRanking-OP1.webm",
            "https://animethemes.moe/video/OusamaRanking-ED1.webm"
        ],
        "title": "Ousama Ranking",
        "synopsis": "The people of the kingdom look down on the young Prince Bojji, who can neither hear nor speak. They call him \"The Useless Prince\" while jeering at his supposed foolishness. However, while Bojji may not be physically strong, he is certainly not weak of heart. When a chance encounter with a shadow creature should have left him traumatized, it instead makes him believe that he has found a friend amidst those who only choose to notice his shortcomings. He starts meeting with Kage, the shadow, regularly, to the point where even the otherwise abrasive creature begins to warm up to him. Kage and Bojji's unlikely friendship lays the budding foundations of the prince's journey, one where he intends to conquer his fears and insecurities. Despite the constant ridicule he faces, Bojji resolves to fulfill his desire of becoming the best king he can be. [Written by MAL Rewrite]",
        "year": 2021,
        "season": "fall",
        "studios": "Wit Studio",
        "genres": "Adventure",
        "rank": 66,
        "images": "https://cdn.myanimelist.net/images/anime/1347/117616l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "2001": {
        "id": "2001",
        "links": [
            "https://animethemes.moe/video/TengenToppaGurrenLagann-OP1.webm",
            "https://animethemes.moe/video/TengenToppaGurrenLagann-OP1v2.webm",
            "https://animethemes.moe/video/TengenToppaGurrenLagann-OP1v3.webm",
            "https://animethemes.moe/video/TengenToppaGurrenLagann-ED1.webm",
            "https://animethemes.moe/video/TengenToppaGurrenLagann-ED1v2.webm",
            "https://animethemes.moe/video/TengenToppaGurrenLagann-ED2.webm",
            "https://animethemes.moe/video/TengenToppaGurrenLagann-ED3.webm"
        ],
        "title": "Tengen Toppa Gurren Lagann",
        "synopsis": "Simon and Kamina were born and raised in a deep, underground village, hidden from the fabled surface. Kamina is a free-spirited loose cannon bent on making a name for himself, while Simon is a timid young boy with no real aspirations. One day while excavating the earth, Simon stumbles upon a mysterious object that turns out to be the ignition key to an ancient artifact of war, which the duo dubs Lagann. Using their new weapon, Simon and Kamina fend off a surprise attack from the surface with the help of Yoko Littner, a hot-blooded redhead wielding a massive gun who wanders the world above. In the aftermath of the battle, the sky is now in plain view, prompting Simon and Kamina to set off on a journey alongside Yoko to explore the wastelands of the surface. Soon, they join the fight against the \"Beastmen,\" humanoid creatures that terrorize the remnants of humanity in powerful robots called \"Gunmen.\" Although they face some challenges and setbacks, the trio bravely fights these new enemies alongside other survivors to reclaim the surface, while slowly unraveling a galaxy-sized mystery. [Written by MAL Rewrite]",
        "year": 2007,
        "season": "spring",
        "studios": "Gainax",
        "genres": "Action",
        "rank": 67,
        "images": "https://cdn.myanimelist.net/images/anime/4/5123l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "34591": {
        "id": "34591",
        "links": [
            "https://animethemes.moe/video/NatsumeYuujinchouRoku-OP1.webm",
            "https://animethemes.moe/video/NatsumeYuujinchouRoku-ED1.webm"
        ],
        "title": "Natsume Yuujinchou Roku",
        "synopsis": "Takashi Natsume has grown accustomed to his encounters with youkai through the Book of Friends, which contains the names of youkai whom his grandmother, Reiko Natsume, has sealed in contracts. These encounters allow Natsume to better understand the youkai, Reiko, and himself. The Book of Friends is a powerful tool that can be used to control youkai; it is sought after by both youkai and exorcists alike. Natsume just wants to live out his daily life in peace but is constantly disrupted by these experiences. If he is to end this torment, Natsume must explore more about the book and the world of exorcism, as well as begin to open his heart to those who can help him. [Written by MAL Rewrite]",
        "year": 2017,
        "season": "spring",
        "studios": "Shuka",
        "genres": "Drama",
        "rank": 70,
        "images": "https://cdn.myanimelist.net/images/anime/6/84416l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "22135": {
        "id": "22135",
        "links": [
            "https://animethemes.moe/video/PingPong-OP1.webm",
            "https://animethemes.moe/video/PingPong-ED1.webm",
            "https://animethemes.moe/video/PingPong-ED2.webm"
        ],
        "title": "Ping Pong the Animation",
        "synopsis": "Despite being polar opposites, Makoto \"Smile\" Tsukimoto and Yutaka \"Peco\" Hoshino have been best friends since childhood. Although the overly confident Peco strives to be the best ping-pong player in the world, he often skips practice, earning the ire of his fellow teammates on the Katase High School ping-pong team. Meanwhile, Smile—in spite of his innate talent for the sport—cannot help but hold back his full strength when playing against others. Through their mutual love for ping-pong, the two have developed a bond that is seemingly unbreakable. When Peco hears that an ex-national team player from China is coming to Japan, he drags Smile over to rival Tsujido High School to observe them. The subsequent trip leads to a clash between Peco and Kong Wenge, who overwhelmingly defeats the former in one game. Stunned by such a comprehensive loss, Peco finds himself questioning why he plays to begin with. Seeing his potential as a player, Katase's coach begins to train Smile to overcome his hesitation, but he is reluctant to play if it is not for enjoyment. As the two struggle to find meaning in the sport, a plethora of stronger players—each with their own internal strifes—await them at the inter-high tournament, where only the very best can persevere. But when these young athletes let their unbridled ambition go unchecked, the hardships they face paint a somber reality as they pursue glory. [Written by MAL Rewrite]",
        "year": 2014,
        "season": "spring",
        "studios": "Tatsunoko Production",
        "genres": "Drama",
        "rank": 71,
        "images": "https://cdn.myanimelist.net/images/anime/10/58041l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "38329": {
        "id": "38329",
        "links": [
            "https://animethemes.moe/video/AobutaMovie-ED1.webm"
        ],
        "title": "Seishun Buta Yarou wa Yumemiru Shoujo no Yume wo Minai",
        "synopsis": "Six months ago, Sakuta Azusagawa had a chance encounter with a bunny girl in a library. Ever since then, he's been blissfully happy with his girlfriend: Mai Sakurajima, that same bunny girl. However, the reappearance of his mysterious first crush, the now-adult Shouko Makinohara, adds a new complication to his relationship with Mai. To make matters worse, he then encounters a middle school Shouko in the hospital, suffering from a grave illness. Mysteriously, his old scars begin throbbing whenever he's near her. With Shouko's bizarre situation somehow revolving around him, Sakuta will need to come to terms with his own conflicting feelings, for better or worse. With a girl's life in his hands, just what can he do? [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "CloverWorks",
        "genres": "Drama",
        "rank": 71,
        "images": "https://cdn.myanimelist.net/images/anime/1613/102179l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "35760": {
        "id": "35760",
        "links": [
            "https://animethemes.moe/video/ShingekiNoKyojinS3-OP1.webm",
            "https://animethemes.moe/video/ShingekiNoKyojinS3-ED1.webm",
            "https://animethemes.moe/video/ShingekiNoKyojinS3-ED1v2.webm"
        ],
        "title": "Shingeki no Kyojin Season 3",
        "synopsis": "Still threatened by the \"Titans\" that rob them of their freedom, mankind remains caged inside the two remaining walls. Efforts to eradicate these monsters continue; however, threats arise not only from the Titans beyond the walls, but from the humans within them as well. After being rescued from the Colossal and Armored Titans, Eren Yaeger devotes himself to improving his Titan form. Krista Lenz struggles to accept the loss of her friend, Captain Levi chooses Eren and his friends to form his new personal squad, and Commander Erwin Smith recovers from his injuries. All seems well for the soldiers, until the government suddenly demands custody of Eren and Krista. The Survey Corps' recent successes have drawn attention, and a familiar face from Levi's past is sent to collect the wanted soldiers. Sought after by the government, Levi and his new squad must evade their adversaries in hopes of keeping Eren and Krista safe. In Shingeki no Kyojin Season 3, Eren and his fellow soldiers are not only fighting for their survival against the terrifying Titans, but also against the terror of a far more conniving foe: humans. [Written by MAL Rewrite]",
        "year": 2018,
        "season": "summer",
        "studios": "Wit Studio",
        "genres": "Action",
        "rank": 72,
        "images": "https://cdn.myanimelist.net/images/anime/1173/92110l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "7311": {
        "id": "7311",
        "links": [
            "https://animethemes.moe/video/SuzumiyaHaruhiNoShoushitsu-OP1.webm",
            "https://animethemes.moe/video/SuzumiyaHaruhiNoShoushitsu-ED1.webm"
        ],
        "title": "Suzumiya Haruhi no Shoushitsu",
        "synopsis": "On a cold December day, Kyon arrives at school prepared for another outing with his fellow SOS Brigade members. However, much to his surprise, he discovers that almost everything has changed completely: Haruhi Suzumiya and Itsuki Koizumi are nowhere to be found; Mikuru Asahina does not recognize him at all; Yuki Nagato is a regular human; and Ryouko Asakura has mysteriously returned. Although he is no stranger to the supernatural, Kyon is disturbed by this odd turn of events and decides to investigate on his own. Finding himself to be the only person that is aware of the previous reality, Kyon is now faced with a difficult choice: to finally live the normal life he has always wanted, or uncover a way to turn back the hands of time and restore his chaotic yet familiar world. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Kyoto Animation",
        "genres": "Mystery",
        "rank": 73,
        "images": "https://cdn.myanimelist.net/images/anime/1248/112352l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "1535": {
        "id": "1535",
        "links": [
            "https://animethemes.moe/video/DeathNote-OP1.webm",
            "https://animethemes.moe/video/DeathNote-OP1v2.webm",
            "https://animethemes.moe/video/DeathNote-OP1v3.webm",
            "https://animethemes.moe/video/DeathNote-OP2.webm",
            "https://animethemes.moe/video/DeathNote-ED1.webm",
            "https://animethemes.moe/video/DeathNote-ED2.webm",
            "https://animethemes.moe/video/DeathNote-ED3.webm"
        ],
        "title": "Death Note",
        "synopsis": "Brutal murders, petty thefts, and senseless violence pollute the human world. In contrast, the realm of death gods is a humdrum, unchanging gambling den. The ingenious 17-year-old Japanese student Light Yagami and sadistic god of death Ryuk share one belief: their worlds are rotten. For his own amusement, Ryuk drops his \"Death Note\" into the human world. Light stumbles upon it, deeming the first of its rules ridiculous: the human whose name is written in this note shall die. However, the temptation is too great, and Light experiments by writing a felon's name, which disturbingly enacts his first murder. Aware of the terrifying godlike power that has fallen into his hands, Light—under the alias \"Kira\"—follows his wicked sense of justice with the ultimate goal of cleansing the world of all evil-doers. The meticulous mastermind detective L is already on his trail, but as Light's brilliance rivals L's, the grand chase for Kira turns into an intense battle of wits that can only end when one of them is dead. [Written by MAL Rewrite]",
        "year": 2006,
        "season": "fall",
        "studios": "Madhouse",
        "genres": "Supernatural",
        "rank": 74,
        "images": "https://cdn.myanimelist.net/images/anime/9/9453l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "12355": {
        "id": "12355",
        "links": [
            "https://animethemes.moe/video/OokamiKodomo-ED1.webm"
        ],
        "title": "Ookami Kodomo no Ame to Yuki",
        "synopsis": "Hana, a hard-working college student, falls in love with a mysterious man who attends one of her classes though he is not an actual student. As it turns out, he is not truly human either. On a full moon night, he transforms, revealing that he is the last werewolf alive. Despite this, Hana's love remains strong, and the two ultimately decide to start a family. Hana gives birth to two healthy children—Ame, born during rainfall, and Yuki, born during snowfall—both possessing the ability to turn into wolves, a trait inherited from their father. All too soon, however, the sudden death of her lover devastates Hana's life, leaving her to raise a peculiar family completely on her own. The stress of raising her wild-natured children in a densely populated city, all while keeping their identity a secret, culminates in a decision to move to the countryside, where she hopes Ame and Yuki can live a life free from the judgments of society. Wolf Children is the heartwarming story about the challenges of being a single mother in an unforgiving modern world. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Studio Chizu",
        "genres": "Fantasy",
        "rank": 77,
        "images": "https://cdn.myanimelist.net/images/anime/9/35721l.jpg",
        "rating": "G - All Ages"
    },
    "19647": {
        "id": "19647",
        "links": [
            "https://animethemes.moe/video/HajimeNoIppoRising-OP1.webm",
            "https://animethemes.moe/video/HajimeNoIppoRising-ED1.webm"
        ],
        "title": "Hajime no Ippo: Rising",
        "synopsis": "Japanese Featherweight Champion Makunouchi Ippo has defended his title belt once more with the help of his devastating signature move: the Dempsey Roll. However, new challengers are rising up left and right, claiming to have an answer for the move responsible for crushing his opponents. Will Ippo be able to step up to the challenge, or will the weight of his pride destroy him before he finds out just what it means to be strong? Meanwhile, fellow Kamogawa Gym mate Aoki Masaru is just a hop, skip, and a Frog Punch away from claiming his own belt, ready to take on the Japanese Lightweight Champion! Hajime no Ippo: Rising continues Ippo's quest to become stronger, featuring the same cast of loveable dimwits from Kamogawa Gym, as they put their bodies and hearts on the line to make their way in the harsh world of professional boxing. With a will of iron, Ippo steps into the ring once again. [Written by MAL Rewrite]",
        "year": 2013,
        "season": "fall",
        "studios": "Madhouse",
        "genres": "Sports",
        "rank": 78,
        "images": "https://cdn.myanimelist.net/images/anime/6/56147l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "31757": {
        "id": "31757",
        "links": [
            "https://animethemes.moe/video/Kizumonogatari2-ED1.webm"
        ],
        "title": "Kizumonogatari II: Nekketsu-hen",
        "synopsis": "No longer truly human, Koyomi Araragi decides to retrieve Kiss-shot Acerola-orion Heart-under-blade's severed body parts that were stolen by three powerful vampire hunters. Awaiting him are Dramaturgie, a vampire hunter who is a vampire himself; Episode, a half-vampire with the ability to transform into mist; and Guillotinecutter, a human priest who is the most dangerous of them all. Unbeknownst to Araragi, each minute he spends trying to retrieve Kiss-shot's limbs makes him less of a human and more of a vampire. Will he be able to keep his wish of becoming human once again by the end of his battles? [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Shaft",
        "genres": "Action",
        "rank": 79,
        "images": "https://cdn.myanimelist.net/images/anime/1981/112812l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "37991": {
        "id": "37991",
        "links": [
            "https://animethemes.moe/video/JojoNoKimyouNaBoukenS5-OP1.webm",
            "https://animethemes.moe/video/JojoNoKimyouNaBoukenS5-OP2.webm",
            "https://animethemes.moe/video/JojoNoKimyouNaBoukenS5-OP2v2.webm",
            "https://animethemes.moe/video/JojoNoKimyouNaBoukenS5-OP2v3.webm",
            "https://animethemes.moe/video/JojoNoKimyouNaBoukenS5-OP2v4.webm",
            "https://animethemes.moe/video/JojoNoKimyouNaBoukenS5-ED1.webm",
            "https://animethemes.moe/video/JojoNoKimyouNaBoukenS5-ED1v2.webm",
            "https://animethemes.moe/video/JojoNoKimyouNaBoukenS5-ED2.webm"
        ],
        "title": "JoJo no Kimyou na Bouken Part 5: Ougon no Kaze",
        "synopsis": "In the coastal city of Naples, corruption is teeming—the police blatantly conspire with outlaws, drugs run rampant around the youth, and the mafia governs the streets with an iron fist. However, various fateful encounters will soon occur. Enter Giorno Giovanna, a 15-year-old boy with an eccentric connection to the Joestar family, who makes a living out of part-time jobs and pickpocketing. Furthermore, he is gifted with the unexplained Stand ability to give and create life—growing plants from the ground and turning inanimate objects into live animals, an ability he has dubbed \"Gold Experience.\" Fascinated by the might of local gangsters, Giorno has dreamed of rising up in their ranks and becoming a \"Gang-Star,\" a feat made possible by his encounter with Bruno Bucciarati, a member of the Passione gang with his own sense of justice. JoJo no Kimyou na Bouken: Ougon no Kaze follows the endeavors of Giorno after joining Bruno's team while working under Passione, fending off other gangsters and secretly plotting to overthrow their mysterious boss. [Written by MAL Rewrite]",
        "year": 2018,
        "season": "fall",
        "studios": "David Production",
        "genres": "Action",
        "rank": 80,
        "images": "https://cdn.myanimelist.net/images/anime/1572/95010l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "32983": {
        "id": "32983",
        "links": [
            "https://animethemes.moe/video/NatsumeYuujinchouGo-OP1.webm",
            "https://animethemes.moe/video/NatsumeYuujinchouGo-ED1.webm"
        ],
        "title": "Natsume Yuujinchou Go",
        "synopsis": "Season 5 of Natsume Yuujinchou.",
        "year": 2016,
        "season": "fall",
        "studios": "Shuka",
        "genres": "Drama",
        "rank": 81,
        "images": "https://cdn.myanimelist.net/images/anime/11/81755l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "10379": {
        "id": "10379",
        "links": [
            "https://animethemes.moe/video/NatsumeYuujinchouSan-OP1.webm",
            "https://animethemes.moe/video/NatsumeYuujinchouSan-ED1.webm"
        ],
        "title": "Natsume Yuujinchou San",
        "synopsis": "Natsume Yuujinchou San follows Takashi Natsume, a boy who is able to see youkai. Natsume and his bodyguard Madara, nicknamed Nyanko-sensei, continue on their quest to release youkai from their contracts in the \"Book of Friends.\" Natsume comes to terms with his ability to see youkai and stops thinking of it as a curse. As he spends more time with his human and youkai friends, he realizes how much he values them both and decides he doesn't have to choose between the spirit and human worlds to be happy. [Written by MAL Rewrite]",
        "year": 2011,
        "season": "summer",
        "studios": "Brain's Base",
        "genres": "Drama",
        "rank": 82,
        "images": "https://cdn.myanimelist.net/images/anime/8/82394l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "28735": {
        "id": "28735",
        "links": [
            "https://animethemes.moe/video/RakugoShinju-OP1.webm",
            "https://animethemes.moe/video/RakugoShinju-ED1.webm",
            "https://animethemes.moe/video/RakugoShinju-ED1v2.webm"
        ],
        "title": "Shouwa Genroku Rakugo Shinjuu",
        "synopsis": "Yotarou is a former yakuza member fresh out of prison and fixated on just one thing: rather than return to a life of crime, the young man aspires to take to the stage of rakugo, a traditional Japanese form of comedic storytelling. Inspired during his incarceration by the performance of distinguished practitioner Yakumo Yuurakutei, he sets his mind on meeting the man who changed his life. After hearing Yotarou's desperate appeal for his mentorship, Yakumo is left with no choice but to accept his very first apprentice. As he eagerly begins his training, Yotarou meets Konatsu, an abrasive young woman who has been under Yakumo's care ever since her beloved father Sukeroku Yuurakutei, another prolific rakugo performer, passed away. Through her hidden passion, Yotarou is drawn to Sukeroku's unique style of rakugo despite learning under contrasting techniques. Upon seeing this, old memories and feelings return to Yakumo who reminisces about a much earlier time when he made a promise with his greatest rival. Shouwa Genroku Rakugo Shinjuu is a story set in both the past and present, depicting the art of rakugo, the relationships it creates, and the lives and hearts of those dedicated to keeping the unique form of storytelling alive. [Written by MAL Rewrite]",
        "year": 2016,
        "season": "winter",
        "studios": "Studio Deen",
        "genres": "Drama",
        "rank": 83,
        "images": "https://cdn.myanimelist.net/images/anime/2/77907l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "4565": {
        "id": "4565",
        "links": [
            "https://animethemes.moe/video/GurrenLagannLagannHen-ED1.webm"
        ],
        "title": "Tengen Toppa Gurren Lagann Movie 2: Lagann-hen",
        "synopsis": "Humans have enjoyed their lavish, peaceful, and prosperous lives for seven years since the day the almighty Spiral King was defeated—the day they reclaimed their homeland, Earth. However, the boon of this lifestyle leaves them unprepared when an unknown, hostile threat arises due to the ever-growing human population. This calamity is the Anti-Spiral—a fearsome enemy with unparalleled power. As the Spiral King's prognosis postulating the destruction of \"The Spiral's World\" begins to come true, the pieces are in place, and Team Dai-Gurren is ready. With his late brother's hope to see a better future for mankind, Simon—along with Nia Teppelin and the rest of the team—is determined to overthrow the mighty Anti-Spiral in order to revive humanity's lost hope. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Gainax",
        "genres": "Action",
        "rank": 84,
        "images": "https://cdn.myanimelist.net/images/anime/12/19698l.jpg",
        "rating": "R+ - Mild Nudity"
    },
    "7785": {
        "id": "7785",
        "links": [
            "https://animethemes.moe/video/YojouhanShinwaTaikei-OP1.webm",
            "https://animethemes.moe/video/YojouhanShinwaTaikei-OP2.webm",
            "https://animethemes.moe/video/YojouhanShinwaTaikei-ED1.webm"
        ],
        "title": "Yojouhan Shinwa Taikei",
        "synopsis": "One autumn evening at a mysterious ramen stand behind the Shimogamo Shrine, a lonely third-year college student bumps into a man with an eggplant-shaped head who calls himself a god of matrimony. Meeting this man causes the student to reflect upon his past two years at college—two years bitterly spent trying to break up couples on campus with his only friend Ozu, a ghoulish-looking man seemingly set on making his life as miserable as possible. Resolving to make the most out of the rest of his college life, the student attempts to ask out the unsociable but kind-hearted underclassman Akashi, yet fails to follow through, prompting him to regret not living out his college life differently. As soon as this thought passes through his head, however, he is hurtled through time and space to the beginning of his years at college and given another chance to live his life. Surreal, artistic, and mind-bending, Yojouhan Shinwa Taikei chronicles the misadventures of a young man on a journey to make friends, find love, and experience the rose-colored campus life he always dreamed of. [Written by MAL Rewrite]",
        "year": 2010,
        "season": "spring",
        "studios": "Madhouse",
        "genres": "Comedy",
        "rank": 85,
        "images": "https://cdn.myanimelist.net/images/anime/10/50457l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "11741": {
        "id": "11741",
        "links": [
            "https://animethemes.moe/video/FateZeroS2-OP1.webm",
            "https://animethemes.moe/video/FateZeroS2-ED1.webm",
            "https://animethemes.moe/video/FateZeroS2-ED2.webm",
            "https://animethemes.moe/video/FateZeroS2-ED3.webm"
        ],
        "title": "Fate/Zero 2nd Season",
        "synopsis": "As the Fourth Holy Grail War rages on with no clear victor in sight, the remaining Servants and their Masters are called upon by Church supervisor Risei Kotomine, in order to band together and confront an impending threat that could unravel the Grail War and bring about the destruction of Fuyuki City. The uneasy truce soon collapses as Masters demonstrate that they will do anything in their power, no matter how despicable, to win. Seeds of doubt are sown between Kiritsugu Emiya and Saber, his Servant, as their conflicting ideologies on heroism and chivalry clash. Meanwhile, an ominous bond forms between Kirei Kotomine, who still seeks to find his purpose in life, and one of the remaining Servants. As the countdown to the end of the war reaches zero, the cost of winning begins to blur the line between victory and defeat. [Written by MAL Rewrite]",
        "year": 2012,
        "season": "spring",
        "studios": "ufotable",
        "genres": "Action",
        "rank": 86,
        "images": "https://cdn.myanimelist.net/images/anime/1522/117645l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "40417": {
        "id": "40417",
        "links": [
            "https://animethemes.moe/video/FruitsBasketS2-OP1.webm",
            "https://animethemes.moe/video/FruitsBasketS2-OP1v2.webm",
            "https://animethemes.moe/video/FruitsBasketS2-OP2.webm",
            "https://animethemes.moe/video/FruitsBasketS2-ED1.webm",
            "https://animethemes.moe/video/FruitsBasketS2-ED2.webm",
            "https://animethemes.moe/video/FruitsBasketS2-ED3.webm"
        ],
        "title": "Fruits Basket 2nd Season",
        "synopsis": "A year has passed since Tooru Honda began living in the Souma residence, and she has since created stronger relationships with its inhabitants Shigure, Kyou, and Yuki. She has also grown closer to the rest of the Souma family and has become familiar with their ancestral secret, having helped them with many of their personal issues. The closer Tooru gets, however, the more she begins to realize that their secret holds a darker truth than she first presumed. Summer is approaching and Tooru is invited to spend her days with the Soumas, mainly Kyou and Yuki. Tooru wishes for an easy-going vacation, but her close relationships with the two boys and the rest of the Soumas may prove to cause trouble. As they grow more intimate, their carefree time together is hindered by older hardships and feelings from the past that begin to resurface. The Eternal Banquet also dawns on the members of the zodiac, and they must tend to their duties alongside the unnerving head of the family, Akito Souma. With the banquet approaching and a plethora of feelings to be solved, will Tooru's life with the Soumas remain peaceful, or will she find herself in a situation from which she cannot escape? [Written by MAL Rewrite]",
        "year": 2020,
        "season": "spring",
        "studios": "TMS Entertainment",
        "genres": "Drama",
        "rank": 87,
        "images": "https://cdn.myanimelist.net/images/anime/1972/111635l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "36098": {
        "id": "36098",
        "links": [
            "https://animethemes.moe/video/KimiSui-OP1.webm",
            "https://animethemes.moe/video/KimiSui-ED1.webm"
        ],
        "title": "Kimi no Suizou wo Tabetai",
        "synopsis": "The aloof protagonist: a bookworm who is deeply detached from the world he resides in. He has no interest in others and is firmly convinced that nobody has any interest in him either. His story begins when he stumbles across a handwritten book, titled \"Living with Dying.\" He soon identifies it as a secret diary belonging to his popular, bubbly classmate Sakura Yamauchi. She then confides in him about the pancreatic disease she is suffering from and that her time left is finite. Only her family knows about her terminal illness; not even her best friends are aware. Despite this revelation, he shows zero sympathy for her plight, but caught in the waves of Sakura's persistent buoyancy, he eventually concedes to accompanying her for her remaining days. As the pair of polar opposites interact, their connection strengthens, interweaving through their choices made with each passing day. Her apparent nonchalance and unpredictability disrupts the protagonist's impassive flow of life, gradually opening his heart as he discovers and embraces the true meaning of living. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Studio VOLN",
        "genres": "Drama",
        "rank": 88,
        "images": "https://cdn.myanimelist.net/images/anime/1768/93291l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "40664": {
        "id": "40664",
        "links": [],
        "title": "Shoujo☆Kageki Revue Starlight Movie",
        "synopsis": "\"Starlight\" - it's a distant star, long ago, and in the far future. Two girls, who were struck by the light of the stage in this play, exchanged their destinies. \"Two people's stars, waiting on stage.\" To burn out ordinary fun and joy and fulfill our destinies. A destiny to become a blast furnace at just 5 years old... what a danger. Eventually the two will meet again. One continued to stand on the stage of tragedy, the other jumped in, separated, jumped in, rewrote their destinies... and created a new chapter full of light. No girl was burned and fell from the tower, nor was she imprisoned. Then... what is the end of that new chapter? \"Starlight\" is a story of an unknown author. Where does the light come from and where does it go? And who is \"starring\" in this story? I want to see it. Hey -- Hanako Aishiro, a third-year student at Seisho Music Academy? (Source: Official website)",
        "year": 2022,
        "season": "summer",
        "studios": "Kinema Citrus"
    },
    "32": {
        "id": "32",
        "links": [
            "https://animethemes.moe/video/EvangelionEndOfEvangelion-ED1.webm"
        ],
        "title": "Neon Genesis Evangelion: The End of Evangelion",
        "synopsis": "Shinji Ikari is left emotionally comatose after the death of a dear friend. With his son mentally unable to pilot the humanoid robot Evangelion Unit-01, Gendou Ikari's NERV races against the shadow organization SEELE to see who can enact their ultimate plan first. SEELE desires to create a godlike being by fusing their own souls into an Evangelion unit, while Gendou wishes to revert all of humanity into one primordial being so that he can be reunited with Yui, his deceased wife. SEELE unleashes its military forces in a lethal invasion of NERV headquarters. As SEELE's forces cut down NERV's scientists and security personnel, Asuka Langley Souryuu pilots Evangelion Unit-02 in a desperate last stand against SEELE's heaviest weaponry. The battle rages on, and a depressed Shinji hides deep within NERV's headquarters. With the fate of the world resting in Shinji's hands, Captain Misato Katsuragi hunts for the teenage boy as society crumbles around them. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Gainax",
        "genres": "Avant Garde",
        "rank": 91,
        "images": "https://cdn.myanimelist.net/images/anime/1404/98182l.jpg",
        "rating": "R+ - Mild Nudity"
    },
    "5300": {
        "id": "5300",
        "links": [
            "https://animethemes.moe/video/ZokuNatsumeYuujinchou-OP1.webm",
            "https://animethemes.moe/video/ZokuNatsumeYuujinchou-ED1.webm"
        ],
        "title": "Zoku Natsume Yuujinchou",
        "synopsis": "As with its prequel, Zoku Natsume Yuujinchou is about Takashi Natsume, a boy who has had the ability to see youkai since he was young, and his bodyguard youkai Madara, nicknamed Nyanko-sensei. Natsume attempts to return names written in his \"Book of Friends\" (which he inherited from his grandmother Reiko) to youkai in his village. Throughout these adventures, he meets some youkai that are friendly, some that want to steal the Book, and some that want to kill him, as Natsume learns about himself and his relationship with these mysterious beings along the way. [Written by MAL Rewrite]",
        "year": 2009,
        "season": "winter",
        "studios": "Brain's Base",
        "genres": "Drama",
        "rank": 92,
        "images": "https://cdn.myanimelist.net/images/anime/4/79738l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "12365": {
        "id": "12365",
        "links": [
            "https://animethemes.moe/video/BakumanS3-OP1.webm",
            "https://animethemes.moe/video/BakumanS3-OP2.webm",
            "https://animethemes.moe/video/BakumanS3-ED1.webm",
            "https://animethemes.moe/video/BakumanS3-ED2.webm"
        ],
        "title": "Bakuman. 3rd Season",
        "synopsis": "Onto their third serialization, manga duo Moritaka Mashiro and Akito Takagi—also known by their pen name, Muto Ashirogi—are ever closer to their dream of an anime adaption. However, the real challenge is only just beginning: if they are unable to compete with the artist Eiji Niizuma in the rankings within the span of six months, they will be canceled. To top it off, numerous rivals are close behind and declaring war. They don't even have enough time to spare thinking about an anime! In Bakuman. 3rd Season, Muto Ashirogi must find a way to stay atop the colossal mountain known as the Shounen Jack rankings. With new problems and new assistants, the pair continue to strive for their dream. [Written by MAL Rewrite]",
        "year": 2012,
        "season": "fall",
        "studios": "J.C.Staff",
        "genres": "Comedy",
        "rank": 93,
        "images": "https://cdn.myanimelist.net/images/anime/6/41845l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "38000": {
        "id": "38000",
        "links": [
            "https://animethemes.moe/video/KimetsuNoYaiba-OP1.webm",
            "https://animethemes.moe/video/KimetsuNoYaiba-OP1v2.webm",
            "https://animethemes.moe/video/KimetsuNoYaiba-OP1v3.webm",
            "https://animethemes.moe/video/KimetsuNoYaiba-OP1v4.webm",
            "https://animethemes.moe/video/KimetsuNoYaiba-ED1.webm",
            "https://animethemes.moe/video/KimetsuNoYaiba-ED2.webm"
        ],
        "title": "Kimetsu no Yaiba",
        "synopsis": "Ever since the death of his father, the burden of supporting the family has fallen upon Tanjirou Kamado's shoulders. Though living impoverished on a remote mountain, the Kamado family are able to enjoy a relatively peaceful and happy life. One day, Tanjirou decides to go down to the local village to make a little money selling charcoal. On his way back, night falls, forcing Tanjirou to take shelter in the house of a strange man, who warns him of the existence of flesh-eating demons that lurk in the woods at night. When he finally arrives back home the next day, he is met with a horrifying sight—his whole family has been slaughtered. Worse still, the sole survivor is his sister Nezuko, who has been turned into a bloodthirsty demon. Consumed by rage and hatred, Tanjirou swears to avenge his family and stay by his only remaining sibling. Alongside the mysterious group calling themselves the Demon Slayer Corps, Tanjirou will do whatever it takes to slay the demons and protect the remnants of his beloved sister's humanity. [Written by MAL Rewrite]",
        "year": 2019,
        "season": "spring",
        "studios": "ufotable",
        "genres": "Action",
        "rank": 94,
        "images": "https://cdn.myanimelist.net/images/anime/1286/99889l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "40776": {
        "id": "40776",
        "links": [
            "https://animethemes.moe/video/HaikyuuS5-OP1.webm",
            "https://animethemes.moe/video/HaikyuuS5-ED1.webm",
            "https://animethemes.moe/video/HaikyuuS5-ED2.webm"
        ],
        "title": "Haikyuu!! To the Top Part 2",
        "synopsis": "Once called a fallen powerhouse and known as \"Flightless Crows,\" Karasuno High School has finally taken flight at nationals. With a comprehensive performance against Tsubakihara Academy in their first match, the team is now facing its toughest opponent yet: the runners-up of the last Spring Tournament, Inarizaki High School. Furthermore, dealing with the formidable twin Miya brothers only makes things more difficult for Karasuno. As soon as the match begins, Karasuno is overwhelmed by all the noise and jeers from the supporters of Inarizaki High but rekindles its strength thanks to its own loyal fans. Karasuno also gains some momentum by utilizing an attack centered on Shouyou Hinata, but the eccentric play of Atsumu and Osamu Miya delivers an unexpected blow that leaves their opponent astounded. Things are bound to get intense as the match progresses between these two teams. Will Karasuno be able to defeat Inarizaki High and overcome the hurdles that threaten its pursuit to the top? [Written by MAL Rewrite]",
        "year": 2020,
        "season": "fall",
        "studios": "Production I.G",
        "genres": "Sports",
        "rank": 95,
        "images": "https://cdn.myanimelist.net/images/anime/1453/106768l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "4282": {
        "id": "4282",
        "links": [
            "https://animethemes.moe/video/KaraNoKyoukai5-ED1.webm"
        ],
        "title": "Kara no Kyoukai Movie 5: Mujun Rasen",
        "synopsis": "In November 1998, a double homicide occurs at the newly constructed Ogawa apartment complex in the heart of Mifune City. The murderer, Tomoe Enjou, has fled in a panic. To his astonishment, he is not pursued by the police and news of the incident has not been reported through media outlets. After Shiki Ryougi defends Tomoe from a group of thugs, she allows him to use her residence as a hideout. However, a few days later, Tomoe is shaken to discover that his mother is alive, even though he is convinced that he killed her. Coincidentally, Mikiya Kokutou is investigating a tip that his associate Touko Aozaki receives regarding the murder at the unique apartment complex. As he uncovers more information about the incident, Mikiya takes a particular interest in Tomoe. Deciding to investigate him further, Mikiya soon discovers the disturbing truth of the foreboding Ogawa complex. The fifth installment of the Kara no Kyoukai film series, Mujun Rasen combines an intricately constructed mystery with established themes and characters to produce a dark, thought-provoking story. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "ufotable",
        "genres": "Action",
        "rank": 96,
        "images": "https://cdn.myanimelist.net/images/anime/1574/112838l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "33": {
        "id": "33",
        "links": [
            "https://animethemes.moe/video/Berserk-OP1.webm",
            "https://animethemes.moe/video/Berserk-ED1.webm"
        ],
        "title": "Kenpuu Denki Berserk",
        "synopsis": "Guts, a man who will one day be known as the Black Swordsman, is a young traveling mercenary characterized by the large greatsword he carries. He accepts jobs that offer the most money, but he never stays with one group for long—until he encounters the Band of the Hawk. Ambushed after completing a job, Guts crushes many of its members in combat. Griffith, The Band of the Falcon's leader and founder, takes an interest in Guts and duels him. While the others are no match for Guts, Griffith defeats him in one blow. Incapacitated and taken into the Band of the Hawk's camp to recover, Guts wakes up two days later. He confronts Griffith, and the two duel yet again, only this time with a condition: Guts will join the Band of the Falcon if he loses. Due to his fresh injuries, Guts loses the fight and is inducted by Griffith. In three years' time, Guts has become one of the Band of the Hawk's commanders. On the battlefield, his combat prowess is second only to Griffith as he takes on large groups of enemies all on his own. With Guts' immense strength and Griffith's leadership, the Band of the Hawk dominate every battle they partake in. But something menacing lurks in the shadows, threatening to change Guts' life forever. [Written by MAL Rewrite]",
        "year": 1997,
        "season": "fall",
        "studios": "OLM",
        "genres": "Action",
        "rank": 97,
        "images": "https://cdn.myanimelist.net/images/anime/1384/119988l.jpg",
        "rating": "R+ - Mild Nudity"
    },
    "35839": {
        "id": "35839",
        "links": [
            "https://animethemes.moe/video/Yorimoi-OP1.webm",
            "https://animethemes.moe/video/Yorimoi-ED1v2.webm",
            "https://animethemes.moe/video/Yorimoi-ED1.webm",
            "https://animethemes.moe/video/Yorimoi-ED1v3.webm",
            "https://animethemes.moe/video/Yorimoi-ED2.webm"
        ],
        "title": "Sora yori mo Tooi Basho",
        "synopsis": "Filled with an overwhelming sense of wonder for the world around her, Mari Tamaki has always dreamt of what lies beyond the reaches of the universe. However, despite harboring such large aspirations on the inside, her fear of the unknown and anxiety over her own possible limitations have always held her back from chasing them. But now, in her second year of high school, Mari is more determined than ever to not let any more of her youth go to waste. Still, her fear continues to prevent her from taking that ambitious step forward—that is, until she has a chance encounter with a girl who has grand dreams of her own. Spurred by her mother's disappearance, Shirase Kobuchizawa has been working hard to fund her trip to Antarctica. Despite facing doubt and ridicule from virtually everyone, Shirase is determined to embark on this expedition to search for her mother in a place further than the universe itself. Inspired by Shirase's resolve, Mari jumps at the chance to join her. Soon, their efforts attract the attention of the bubbly Hinata Miyake, who is eager to stand out, and Yuzuki Shiraishi, a polite girl from a high class background. Together, they set sail toward the frozen south. Sora yori mo Tooi Basho follows the captivating journey of four spirited girls, all in search of something great. [Written by MAL Rewrite]",
        "year": 2018,
        "season": "winter",
        "studios": "Madhouse",
        "genres": "Adventure",
        "rank": 98,
        "images": "https://cdn.myanimelist.net/images/anime/6/89879l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "10165": {
        "id": "10165",
        "links": [
            "https://animethemes.moe/video/Nichijou-OP1.webm",
            "https://animethemes.moe/video/Nichijou-OP2.webm",
            "https://animethemes.moe/video/Nichijou-ED1.webm",
            "https://animethemes.moe/video/Nichijou-ED2.webm",
            "https://animethemes.moe/video/Nichijou-ED3.webm",
            "https://animethemes.moe/video/Nichijou-ED4.webm",
            "https://animethemes.moe/video/Nichijou-ED5.webm",
            "https://animethemes.moe/video/Nichijou-ED6.webm",
            "https://animethemes.moe/video/Nichijou-ED7.webm",
            "https://animethemes.moe/video/Nichijou-ED8.webm",
            "https://animethemes.moe/video/Nichijou-ED9.webm",
            "https://animethemes.moe/video/Nichijou-ED10.webm",
            "https://animethemes.moe/video/Nichijou-ED11.webm",
            "https://animethemes.moe/video/Nichijou-ED12.webm",
            "https://animethemes.moe/video/Nichijou-ED13.webm",
            "https://animethemes.moe/video/Nichijou-ED14.webm",
            "https://animethemes.moe/video/Nichijou-ED15.webm",
            "https://animethemes.moe/video/Nichijou-ED16.webm"
        ],
        "title": "Nichijou",
        "synopsis": "Nichijou primarily focuses on the daily antics of a trio of childhood friends—high school girls Mio Naganohara, Yuuko Aioi and Mai Minakami—whose stories soon intertwine with the young genius Hakase Shinonome, her robot caretaker Nano, and their talking cat Sakamoto. With every passing day, the lives of these six, as well as of the many people around them, experience both the calms of normal life and the insanity of the absurd. Walking to school, being bitten by a talking crow, spending time with friends, and watching the principal suplex a deer: they are all in a day's work in the extraordinary everyday lives of those in Nichijou. [Written by MAL Rewrite]",
        "year": 2011,
        "season": "spring",
        "studios": "Kyoto Animation",
        "genres": "Comedy",
        "rank": 130,
        "images": "https://cdn.myanimelist.net/images/anime/3/75617l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "37779": {
        "id": "37779",
        "links": [
            "https://animethemes.moe/video/YakusokuNoNeverland-OP1.webm",
            "https://animethemes.moe/video/YakusokuNoNeverland-ED1.webm",
            "https://animethemes.moe/video/YakusokuNoNeverland-ED2.webm"
        ],
        "title": "Yakusoku no Neverland",
        "synopsis": "Surrounded by a forest and a gated entrance, the Grace Field House is inhabited by orphans happily living together as one big family, looked after by their \"Mama,\" Isabella. Although they are required to take tests daily, the children are free to spend their time as they see fit, usually playing outside, as long as they do not venture too far from the orphanage—a rule they are expected to follow no matter what. However, all good times must come to an end, as every few months, a child is adopted and sent to live with their new family, never to be heard from again. However, the three oldest siblings have their suspicions about what is actually happening at the orphanage, and they are about to discover the cruel fate that awaits the children living at Grace Field, including the twisted nature of their beloved Mama. [Written by MAL Rewrite]",
        "year": 2019,
        "season": "winter",
        "studios": "CloverWorks",
        "genres": "Mystery",
        "rank": 99,
        "images": "https://cdn.myanimelist.net/images/anime/1830/118780l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "16498": {
        "id": "16498",
        "links": [
            "https://animethemes.moe/video/ShingekiNoKyojin-OP1.webm",
            "https://animethemes.moe/video/ShingekiNoKyojin-OP2.webm",
            "https://animethemes.moe/video/ShingekiNoKyojin-ED1.webm",
            "https://animethemes.moe/video/ShingekiNoKyojin-ED2.webm"
        ],
        "title": "Shingeki no Kyojin",
        "synopsis": "Centuries ago, mankind was slaughtered to near extinction by monstrous humanoid creatures called Titans, forcing humans to hide in fear behind enormous concentric walls. What makes these giants truly terrifying is that their taste for human flesh is not born out of hunger but what appears to be out of pleasure. To ensure their survival, the remnants of humanity began living within defensive barriers, resulting in one hundred years without a single titan encounter. However, that fragile calm is soon shattered when a colossal Titan manages to breach the supposedly impregnable outer wall, reigniting the fight for survival against the man-eating abominations. After witnessing a horrific personal loss at the hands of the invading creatures, Eren Yeager dedicates his life to their eradication by enlisting into the Survey Corps, an elite military unit that combats the merciless humanoids outside the protection of the walls. Eren, his adopted sister Mikasa Ackerman, and his childhood friend Armin Arlert join the brutal war against the Titans and race to discover a way of defeating them before the last walls are breached. [Written by MAL Rewrite]",
        "year": 2013,
        "season": "spring",
        "studios": "Wit Studio",
        "genres": "Action",
        "rank": 100,
        "images": "https://cdn.myanimelist.net/images/anime/10/47347l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "36296": {
        "id": "36296",
        "links": [
            "https://animethemes.moe/video/Hinamatsuri-OP1.webm",
            "https://animethemes.moe/video/Hinamatsuri-OP1v2.webm",
            "https://animethemes.moe/video/Hinamatsuri-OP1v3.webm",
            "https://animethemes.moe/video/Hinamatsuri-OP1v4.webm",
            "https://animethemes.moe/video/Hinamatsuri-OP1v5.webm",
            "https://animethemes.moe/video/Hinamatsuri-OP1v6.webm",
            "https://animethemes.moe/video/Hinamatsuri-ED1.webm",
            "https://animethemes.moe/video/Hinamatsuri-ED1v2.webm",
            "https://animethemes.moe/video/Hinamatsuri-ED1v3.webm",
            "https://animethemes.moe/video/Hinamatsuri-ED1v4.webm",
            "https://animethemes.moe/video/Hinamatsuri-ED1v5.webm",
            "https://animethemes.moe/video/Hinamatsuri-ED2.webm",
            "https://animethemes.moe/video/Hinamatsuri-ED3.webm"
        ],
        "title": "Hinamatsuri (TV)",
        "synopsis": "While reveling in the successful clinching of a prized vase for his collection, Yoshifumi Nitta, a yakuza member, is rudely interrupted when a large, peculiar capsule suddenly materializes and falls on his head. He opens the capsule to reveal a young, blue-haired girl, who doesn't divulge anything about herself but her name—Hina—and the fact that she possesses immense powers. As if things couldn't get any worse, she loses control and unleashes an explosion if her powers remain unused. Faced with no other choice, Nitta finds himself becoming her caregiver. To let her use her powers freely, Nitta asks Hina to help out with a construction deal, which goes smoothly. But while this is happening, a rival yakuza group covertly attacks his boss. To Nitta's shock, his colleagues later pin the blame on him! Tasked with attacking the rival group in retaliation, Nitta steels himself and arrives at their hideout. But suddenly, Hina unexpectedly steps in and helps him wipe out the entire group. As it turns out, Hina might just become a valuable asset to Nitta and his yakuza business, provided she does not use her powers on him first! And so the strange life of this unusual duo begins. [Written by MAL Rewrite]",
        "year": 2018,
        "season": "spring",
        "studios": "feel.",
        "genres": "Comedy",
        "rank": 369,
        "images": "https://cdn.myanimelist.net/images/anime/1580/93526l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "392": {
        "id": "392",
        "links": [
            "https://animethemes.moe/video/YuuYuuHakusho-OP1.webm",
            "https://animethemes.moe/video/YuuYuuHakusho-ED1.webm",
            "https://animethemes.moe/video/YuuYuuHakusho-ED2.webm",
            "https://animethemes.moe/video/YuuYuuHakusho-ED3.webm",
            "https://animethemes.moe/video/YuuYuuHakusho-ED4.webm",
            "https://animethemes.moe/video/YuuYuuHakusho-ED5.webm",
            "https://animethemes.moe/video/YuuYuuHakushoDub-OP1.webm",
            "https://animethemes.moe/video/YuuYuuHakushoDub-ED1.webm",
            "https://animethemes.moe/video/YuuYuuHakushoDub-ED2.webm",
            "https://animethemes.moe/video/YuuYuuHakushoDub-ED3.webm",
            "https://animethemes.moe/video/YuuYuuHakushoDub-ED4.webm",
            "https://animethemes.moe/video/YuuYuuHakushoDub-ED5.webm"
        ],
        "title": "Yuu☆Yuu☆Hakusho",
        "synopsis": "One fateful day, Yuusuke Urameshi, a 14-year-old delinquent with a dim future, gets a miraculous chance to turn it all around when he throws himself in front of a moving car to save a young boy. His ultimate sacrifice is so out of character that the authorities of the spirit realm are not yet prepared to let him pass on. Koenma, heir to the throne of the spirit realm, offers Yuusuke an opportunity to regain his life through completion of a series of tasks. With the guidance of the death god Botan, he is to thwart evil presences on Earth as a Spirit Detective. To help him on his venture, Yuusuke enlists ex-rival Kazuma Kuwabara, and two demons, Hiei and Kurama, who have criminal pasts. Together, they train and battle against enemies who would threaten humanity's very existence. [Written by MAL Rewrite]",
        "year": 1992,
        "season": "fall",
        "studios": "Studio Pierrot",
        "genres": "Action",
        "rank": 141,
        "images": "https://cdn.myanimelist.net/images/anime/1228/111372l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "9989": {
        "id": "9989",
        "links": [
            "https://animethemes.moe/video/Anohana-OP1.webm",
            "https://animethemes.moe/video/Anohana-ED1.webm",
            "https://animethemes.moe/video/Anohana-ED2.webm",
            "https://animethemes.moe/video/Anohana-ED2v2.webm",
            "https://animethemes.moe/video/Anohana-ED3.webm",
            "https://animethemes.moe/video/Anohana-OP2.webm"
        ],
        "title": "Ano Hi Mita Hana no Namae wo Bokutachi wa Mada Shiranai.",
        "synopsis": "Jinta Yadomi is peacefully living as a recluse, spending his days away from school and playing video games at home instead. One hot summer day, his childhood friend, Meiko \"Menma\" Honma, appears and pesters him to grant a forgotten wish. He pays her no mind, which annoys her, but he doesn't really care. After all, Menma already died years ago. At first, Jinta thinks that he is merely hallucinating due to the summer heat, but he is later on convinced that what he sees truly is the ghost of Menma. Jinta and his group of childhood friends grew apart after her untimely death, but they are drawn together once more as they try to lay Menma's spirit to rest. Re-living their pain and guilt, will they be able to find the strength to help not only Menma move on—but themselves as well? [Written by MAL Rewrite]",
        "year": 2011,
        "season": "spring",
        "studios": "A-1 Pictures",
        "genres": "Drama",
        "rank": 213,
        "images": "https://cdn.myanimelist.net/images/anime/5/79697l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "28223": {
        "id": "28223",
        "links": [
            "https://animethemes.moe/video/DeathParade-OP1.webm",
            "https://animethemes.moe/video/DeathParade-ED1.webm"
        ],
        "title": "Death Parade",
        "synopsis": "After death, either Heaven or Hell awaits most humans. But for a select few, death brings them to Quindecim—a bar where only pairs of people who die at the same time can enter. Attending the bar is an enigmatic figure known as Decim, who also acts as the arbiter. He passes judgment on those who wind up at Quindecim by challenging them to a life-threatening game. These games determine if the patron's soul will reincarnate into a new life, or be sent into the void, never to be seen again. From darts and bowling to fighting games, the true nature of each patron slowly comes to light as they wager their souls. Though his methods remain unchanged, the sudden appearance of a black-haired amnesiac causes Decim to reevaluate his own rulings. [Written by MAL Rewrite]",
        "year": 2015,
        "season": "winter",
        "studios": "Madhouse",
        "genres": "Drama",
        "rank": 358,
        "images": "https://cdn.myanimelist.net/images/anime/5/71553l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "38668": {
        "id": "38668",
        "links": [
            "https://animethemes.moe/video/Dorohedoro-OP1.webm",
            "https://animethemes.moe/video/Dorohedoro-ED1.webm",
            "https://animethemes.moe/video/Dorohedoro-ED1v2.webm",
            "https://animethemes.moe/video/Dorohedoro-ED2.webm",
            "https://animethemes.moe/video/Dorohedoro-ED3.webm",
            "https://animethemes.moe/video/Dorohedoro-ED4.webm",
            "https://animethemes.moe/video/Dorohedoro-ED5.webm",
            "https://animethemes.moe/video/Dorohedoro-ED6.webm"
        ],
        "title": "Dorohedoro",
        "synopsis": "Hole—a dark, decrepit, and disorderly district where the strong prey on the weak and death is an ordinary occurrence—is all but befitting of the name given to it. A realm separated from law and ethics, it is a testing ground to the magic users who dominate it. As a race occupying the highest rungs of their society, the magic users think of the denizens of Hole as no more than insects. Murdered, mutilated, and made experiments without a second thought, the powerless Hole dwellers litter the halls of Hole's hospital on a daily basis. Possessing free access to and from the cesspool, and with little challenge to their authority, the magic users appear indomitable to most—aside for a few. Kaiman, more reptile than man, is one such individual. He hunts them on a heedless quest for answers with only a trusted pair of bayonets and his immunity to magic. Cursed by his appearance and tormented by nightmares, magic users are his only clue to restoring his life to normal. With his biggest obstacle being his stomach, his female companion Nikaidou, who runs the restaurant Hungry Bug, is his greatest ally. Set in a gritty world of hellish design, Dorohedoro manages a healthy blend of comedy and lightheartedness with death and carnage. Taking plenty of twists and turns while following the lives of Hole's residents, it weaves a unique world of unearthly origin and dreary appearance not for the squeamish or easily disturbed. [Written by MAL Rewrite]",
        "year": 2020,
        "season": "winter",
        "studios": "MAPPA",
        "genres": "Action",
        "rank": 482,
        "images": "https://cdn.myanimelist.net/images/anime/1740/104786l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "223": {
        "id": "223",
        "links": [
            "https://animethemes.moe/video/DragonBall-OP1.webm",
            "https://animethemes.moe/video/DragonBall-OP1v2.webm",
            "https://animethemes.moe/video/DragonBall-ED1.webm",
            "https://animethemes.moe/video/DragonBall-ED1v2.webm",
            "https://animethemes.moe/video/DragonBall-ED1v3.webm",
            "https://animethemes.moe/video/DragonBall-ED1v4.webm",
            "https://animethemes.moe/video/DragonBallDub-OP1.webm",
            "https://animethemes.moe/video/DragonBallDub-ED1.webm"
        ],
        "title": "Dragon Ball",
        "synopsis": "Gokuu Son is a young boy who lives in the woods all alone—that is, until a girl named Bulma runs into him in her search for a set of magical objects called the \"Dragon Balls.\" Since the artifacts are said to grant one wish to whoever collects all seven, Bulma hopes to gather them and wish for a perfect boyfriend. Gokuu happens to be in possession of a dragon ball, but unfortunately for Bulma, he refuses to part ways with it, so she makes him a deal: he can tag along on her journey if he lets her borrow the dragon ball's power. With that, the two set off on the journey of a lifetime. They don't go on the journey alone. On the way, they meet the old Muten-Roshi and wannabe disciple Kuririn, with whom Gokuu trains to become a stronger martial artist for the upcoming World Martial Arts Tournament. However, it's not all fun and games; the ability to make any wish come true is a powerful one, and there are others who would do much worse than just wishing for a boyfriend. To stop those who would try to abuse the legendary power, they train to become stronger fighters, using their newfound strength to help the people around them along the way. [Written by MAL Rewrite]",
        "year": 1986,
        "season": "winter",
        "studios": "Toei Animation",
        "genres": "Adventure",
        "rank": 613,
        "images": "https://cdn.myanimelist.net/images/anime/1887/92364l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "6746": {
        "id": "6746",
        "links": [
            "https://animethemes.moe/video/Durarara-OP1.webm",
            "https://animethemes.moe/video/Durarara-OP2.webm",
            "https://animethemes.moe/video/Durarara-ED1.webm",
            "https://animethemes.moe/video/Durarara-ED2.webm"
        ],
        "title": "Durarara!!",
        "synopsis": "In Tokyo's downtown district of Ikebukuro, amidst many strange rumors and warnings of anonymous gangs and dangerous occupants, one urban legend stands out above the rest—the existence of a headless \"Black Rider\" who is said to be seen driving a jet-black motorcycle through the city streets. Mikado Ryuugamine has always longed for the excitement of the city life, and an invitation from a childhood friend convinces him to move to Tokyo. Witnessing the Black Rider on his first day in the city, his wishes already seem to have been granted. But as supernatural events begin to occur, ordinary citizens like himself, along with Ikebukuro's most colorful inhabitants, are mixed up in the commotion breaking out in their city. [Written by MAL Rewrite]",
        "year": 2010,
        "season": "winter",
        "studios": "Brain's Base",
        "genres": "Action",
        "rank": 413,
        "images": "https://cdn.myanimelist.net/images/anime/10/71772l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "39792": {
        "id": "39792",
        "links": [
            "https://animethemes.moe/video/Eizouken-OP1.webm",
            "https://animethemes.moe/video/Eizouken-ED1.webm"
        ],
        "title": "Eizouken ni wa Te wo Dasu na!",
        "synopsis": "Midori Asakusa sees the world a bit differently. Always having her nose in a sketchbook, Asakusa draws detailed landscapes and backgrounds of both the world around her and the one within her boundless imagination. Even the simple act of doodling on a wall evolves into an emergency repair on the outer hull of her spaceship. She is only brought back to reality by her best friend Sayaka Kanamori. The pair are stark opposites, with Asakusa's childlike wonder contrasted by Kanamori's calculated approach to life. After a chance encounter where the two \"save\" the young model Tsubame Misuzaki from her overprotective bodyguard, a connection instantly sparks between Asakusa and Misuzaki, as both share an intense passion for art and animation. Whereas Asakusa is interested in backgrounds and settings, Misuzaki loves drawing the human form. Sensing a money-making opportunity, Kanamori suggests that they start an animation club, which they disguise as a motion picture club since the school already has an anime club. Thus begins the trio's journey of producing animation that will awe the world. From the brilliant mind of Masaaki Yuasa, Eizouken ni wa Te wo Dasu na! is a love letter to animation, wildly creative in its approach, and a testament to the potential of the medium. [Written by MAL Rewrite]",
        "year": 2020,
        "season": "winter",
        "studios": "Science SARU",
        "genres": "Adventure",
        "rank": 386,
        "images": "https://cdn.myanimelist.net/images/anime/1680/110451l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "227": {
        "id": "227",
        "links": [
            "https://animethemes.moe/video/FLCL-ED1.webm",
            "https://animethemes.moe/video/FLCL-ED1v2.webm"
        ],
        "title": "FLCL",
        "synopsis": "Naota Nandaba is an ordinary sixth grader living in a city where nothing amazing ever seems to happen. After his brother Tasuku leaves town to play baseball in America, Naota takes it upon himself to look after everything Tasuku left behind—from his top bunk bed to his ex-girlfriend Mamimi Samejima, who hasn't stopped clinging to Naota since Tasuku left. Little does Naota know, however, that his mundane existence is on the verge of being changed forever: enter Haruko Haruhara, a Vespa-riding, bass guitar-wielding, pink-haired psychopath whose first encounter with Naota leaves him with tire tracks on his back and a giant horn on his head. Though all he wants is some peace and quiet, when Haruko takes up residence at his parents' home, Naota finds himself dragged into the heart of the greatest battle for supremacy that Earth—and quite possibly the entire universe—has ever seen. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Gainax",
        "genres": "Action",
        "rank": 530,
        "images": "https://cdn.myanimelist.net/images/anime/7/77356l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "268": {
        "id": "268",
        "links": [
            "https://animethemes.moe/video/GoldenBoy-OP1.webm",
            "https://animethemes.moe/video/GoldenBoy-ED1.webm"
        ],
        "title": "Golden Boy",
        "synopsis": "Kintarou Ooe is a specialist in part-time work, riding all over the highways and byways of Japan on his trusty steed, the Mikazuki 5, and finding employment wherever he can. His adventures bring him knowledge and experience that can't be taught in a classroom, from political corruption to the delicacy of a young woman's heart. With nothing but the open road before him—not to mention the many beautiful women along the way—Kintarou pursues his spirit of education while attempting to hold down his various odd jobs, however undignified they may be. As he learns from each task he takes on, who knows what could happen? He might even be able to save the world one day. One thing is for sure—this will all be very educational! [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "APPP",
        "genres": "Adventure",
        "rank": 536,
        "images": "https://cdn.myanimelist.net/images/anime/3/62867l.jpg",
        "rating": "R+ - Mild Nudity"
    },
    "24439": {
        "id": "24439",
        "links": [
            "https://animethemes.moe/video/KekkaiSensen-OP1.webm",
            "https://animethemes.moe/video/KekkaiSensen-ED1.webm"
        ],
        "title": "Kekkai Sensen",
        "synopsis": "Supersonic monkeys, vampires, talking fishmen, and all sorts of different supernatural monsters living alongside humans—this has been part of daily life in Hellsalem's Lot, formerly known as New York City, for some time now. When a gateway between Earth and the Beyond opened three years ago, New Yorkers and creatures from the other dimension alike were trapped in an impenetrable bubble and were forced to live together. Libra is a secret organization composed of eccentrics and superhumans, tasked with keeping order in the city and making sure that chaos doesn't spread to the rest of the world. Pursuing photography as a hobby, Leonardo Watch is living a normal life with his parents and sister. But when he obtains the \"All-seeing Eyes of the Gods\" at the expense of his sister's eyesight, he goes to Hellsalem's Lot in order to help her by finding answers about the mysterious powers he received. He soon runs into Libra, and when Leo unexpectedly joins their ranks, he gets more than what he bargained for. Kekkai Sensen follows Leo's misadventures in the strangest place on Earth with his equally strange comrades—as the ordinary boy unwittingly sees his life take a turn for the extraordinary. [Written by MAL Rewrite]",
        "year": 2015,
        "season": "spring",
        "studios": "Bones",
        "genres": "Action",
        "rank": 1336,
        "images": "https://cdn.myanimelist.net/images/anime/12/73559l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "11771": {
        "id": "11771",
        "links": [
            "https://animethemes.moe/video/KurokoNoBasket-OP1.webm",
            "https://animethemes.moe/video/KurokoNoBasket-OP2.webm",
            "https://animethemes.moe/video/KurokoNoBasket-ED1.webm",
            "https://animethemes.moe/video/KurokoNoBasket-ED2.webm",
            "https://animethemes.moe/video/KurokoNoBasket-ED2v2.webm"
        ],
        "title": "Kuroko no Basket",
        "synopsis": "For the last three years, Teikou Middle School has dominated the national basketball scene with its legendary lineup: the \"Generation of Miracles.\" It consisted of five prodigies who excelled at the sport, but a \"Phantom Sixth Man\" lurked in the shadows and helped earn the team their revered status. Eventually, their monstrous growth jaded them from the sport they loved and made them go their separate ways in high school. In search of new members, the Seirin High School basketball team recruits Taiga Kagami and Tetsuya Kuroko, two freshmen who seem to have significant differences in abilities. Having returned recently from America, Kagami has both a natural aptitude and relentless love for the sport. Meanwhile, Kuroko lacks presence and exhibits no outstanding athletic talent. However, it is later revealed that he is Teikou's Phantom Sixth Man—the player once part of the Generation of Miracles. Kuroko wants to prove to the Seirin team that he is strong in his own way. Seeing his conviction, Kagami forms a dynamic partnership with Kuroko, the latter promising to support Kagami's \"light\" as his \"shadow.\" Alongside their new Seirin teammates, they aim to conquer the upcoming Interhigh championship, but the reappearance of Kuroko's former teammates complicates their plan. [Written by MAL Rewrite]",
        "year": 2012,
        "season": "spring",
        "studios": "Production I.G",
        "genres": "Sports",
        "rank": 472,
        "images": "https://cdn.myanimelist.net/images/anime/11/50453l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "21185": {
        "id": "21185",
        "links": [
            "https://animethemes.moe/video/BabySteps-OP1.webm",
            "https://animethemes.moe/video/BabySteps-ED1.webm"
        ],
        "title": "Baby Steps",
        "synopsis": "Diligent and methodical honor student Eiichirou Maruo decides to exercise more during the little free time he has available because he is worried about his health. For this reason, after seeing a flyer, he joins the Southern Tennis Club at the beginning of his freshman year. During his free trial at the club, he meets Natsu Takasaki, another first year student, who is determined on becoming a professional tennis player due to her love for the sport. In contrast, Eiichirou's study-oriented life exists because he believes that it is what he has to do, not because he enjoys it. However, his monotonous days come to an end as the more he plays tennis, the more he becomes fascinated by it. Baby Steps is the story of a boy who makes the most of his hard-working and perfectionist nature to develop his own unique playing style. Little by little, Eiichirou's skills begin to improve, and he hopes to stand on equal footing with tennis' best players. [Written by MAL Rewrite]",
        "year": 2014,
        "season": "spring",
        "studios": "Studio Pierrot",
        "genres": "Sports",
        "rank": 867,
        "images": "https://cdn.myanimelist.net/images/anime/5/63361l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "22789": {
        "id": "22789",
        "links": [
            "https://animethemes.moe/video/Barakamon-OP1.webm",
            "https://animethemes.moe/video/Barakamon-ED1.webm"
        ],
        "title": "Barakamon",
        "synopsis": "Seishuu Handa is an up-and-coming calligrapher: young, handsome, talented, and unfortunately, a narcissist to boot. When a veteran labels his award-winning piece as \"unoriginal,\" Seishuu quickly loses his cool with severe repercussions. As punishment, and also in order to aid him in self-reflection, Seishuu's father exiles him to the Goto Islands, far from the comfortable Tokyo lifestyle the temperamental artist is used to. Now thrown into a rural setting, Seishuu must attempt to find new inspiration and develop his own unique art style—that is, if boisterous children (headed by the frisky Naru Kotoishi), fujoshi middle schoolers, and energetic old men stop barging into his house! The newest addition to the intimate and quirky Goto community only wants to get some work done, but the islands are far from the peaceful countryside he signed up for. Thanks to his wacky neighbors who are entirely incapable of minding their own business, the arrogant calligrapher learns so much more than he ever hoped to. [Written by MAL Rewrite]",
        "year": 2014,
        "season": "summer",
        "studios": "Kinema Citrus",
        "genres": "Slice of Life",
        "rank": 171,
        "images": "https://cdn.myanimelist.net/images/anime/1426/111248l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "40729": {
        "id": "40729",
        "links": [
            "https://animethemes.moe/video/Nomad-OP1.webm",
            "https://animethemes.moe/video/Nomad-ED1.webm",
            "https://animethemes.moe/video/Nomad-ED2.webm"
        ],
        "title": "Nomad: Megalo Box 2",
        "synopsis": "Megalo Box is an advanced form of boxing where competitors wear metal frames called Gear. When the first ever Megalonia tournament took place, \"Gearless\" Joe became its champion and known to all as a legendary fighter. However, soon after, he lost an exhibition match against the second champion and vanished from the public eye. Seven years later, Joe now goes by \"Nomad\" and keeps a low profile, occasionally fighting in a few underground matches to get by. He is haunted by hallucinations and relies on a set of painkillers to numb his mind. During a match, Joe wins against an opponent, Chief, who purposefully loses for some extra cash from gamblers. Subsequently, Joe discovers that Chief is from a community of immigrants called the Casa. Chief is gradually trying to make enough money to purchase the land where they live illegally. At first, Joe hesitates to get involved, but eventually decides to lend the Casa a helping hand. [Written by MAL Rewrite]",
        "year": 2021,
        "season": "spring",
        "studios": "TMS Entertainment",
        "genres": "Drama",
        "rank": 314,
        "images": "https://cdn.myanimelist.net/images/anime/1190/113352l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "1210": {
        "id": "1210",
        "links": [
            "https://animethemes.moe/video/NHKNiYoukoso-OP1.webm",
            "https://animethemes.moe/video/NHKNiYoukoso-OP2.webm",
            "https://animethemes.moe/video/NHKNiYoukoso-ED1.webm",
            "https://animethemes.moe/video/NHKNiYoukoso-ED2.webm"
        ],
        "title": "NHK ni Youkoso!",
        "synopsis": "Twenty-two-year-old college dropout Tatsuhiro Satou has been a hikikomori for almost four years now. In his isolation, he has come to believe in many obscure conspiracy theories, but there is one in particular which he holds unshakable faith in: the theory that the evil conspirator behind his shut-in NEET (Not in Employment, Education or Training) status is the Nihon Hikikomori Kyokai (NHK)—an evil and secret organization dedicated to fostering the spread of hikikomori culture. NHK ni Youkoso! is a psychological dramedy that follows Tatsuhiro as he strives to escape from the NHK's wicked machinations and the disease of self-wrought isolation, while struggling to even just leave his apartment and find a job. His unexpected encounter with the mysterious Misaki Nakahara might signal a reversal of fortune for Tatsuhiro, but with this meeting comes the inevitable cost of having to face his greatest fear—society. [Written by MAL Rewrite]",
        "year": 2006,
        "season": "summer",
        "studios": "Gonzo",
        "genres": "Comedy",
        "rank": 222,
        "images": "https://cdn.myanimelist.net/images/anime/3/52675l.jpg",
        "rating": "R+ - Mild Nudity"
    },
    "30276": {
        "id": "30276",
        "links": [
            "https://animethemes.moe/video/OnePunchMan-OP1.webm",
            "https://animethemes.moe/video/OnePunchMan-ED1.webm",
            "https://animethemes.moe/video/OnePunchMan-ED2.webm"
        ],
        "title": "One Punch Man",
        "synopsis": "The seemingly unimpressive Saitama has a rather unique hobby: being a hero. In order to pursue his childhood dream, Saitama relentlessly trained for three years, losing all of his hair in the process. Now, Saitama is so powerful, he can defeat any enemy with just one punch. However, having no one capable of matching his strength has led Saitama to an unexpected problem—he is no longer able to enjoy the thrill of battling and has become quite bored. One day, Saitama catches the attention of 19-year-old cyborg Genos, who witnesses his power and wishes to become Saitama’s disciple. Genos proposes that the two join the Hero Association in order to become certified heroes that will be recognized for their positive contributions to society. Saitama, who is shocked that no one knows who he is, quickly agrees. Meeting new allies and taking on new foes, Saitama embarks on a new journey as a member of the Hero Association to experience the excitement of battle he once felt. [Written by MAL Rewrite]",
        "year": 2015,
        "season": "fall",
        "studios": "Madhouse",
        "genres": "Action",
        "rank": 111,
        "images": "https://cdn.myanimelist.net/images/anime/12/76049l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "2966": {
        "id": "2966",
        "links": [
            "https://animethemes.moe/video/OokamiToKoushinryou-OP1.webm",
            "https://animethemes.moe/video/OokamiToKoushinryou-ED1.webm"
        ],
        "title": "Ookami to Koushinryou",
        "synopsis": "Holo is a powerful wolf deity who is revered in the small town of Pasloe for blessing the annual harvest. Yet as years go by and the villagers become more self-sufficient, Holo has been reduced to a mere folktale. When a traveling merchant named Kraft Lawrence stops at the settlement, Holo offers to become his business partner if he takes her to her northern home of Yoitsu. The savvy trader recognizes Holo's unusual ability to evaluate a person's character and accepts her proposition. Now in the possession of both sharp bargaining skills and a charismatic negotiator, Lawrence inches closer to his goal of opening his own shop. However, as Lawrence travels the countryside with Holo in search of economic opportunities, he begins to realize that his aspirations are slowly morphing into something unexpected. [Written by MAL Rewrite]",
        "year": 2008,
        "season": "winter",
        "studios": "Imagin",
        "genres": "Adventure",
        "rank": 285,
        "images": "https://cdn.myanimelist.net/images/anime/5/59401l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "28297": {
        "id": "28297",
        "links": [
            "https://animethemes.moe/video/OreMonogatari-OP1.webm",
            "https://animethemes.moe/video/OreMonogatari-OP1v2.webm",
            "https://animethemes.moe/video/OreMonogatari-OP1v3.webm",
            "https://animethemes.moe/video/OreMonogatari-ED1.webm"
        ],
        "title": "Ore Monogatari!!",
        "synopsis": "With his muscular build and tall stature, Takeo Gouda is no ordinary high school freshman. However, behind Takeo's intimidating appearance lies a pure heart of gold, and he is considered a hero by his male peers for his courage and chivalry. Unfortunately for Takeo, his appearance does not bode well for his love life. As if his looks were not already enough to scare the opposite sex away, Takeo's cool, handsome best friend and constant companion Makoto Sunakawa easily, and unintentionally, steals the hearts of the female students—including every girl Takeo has ever liked. One day, when Takeo saves cute Rinko Yamato from being molested, he falls in love with her instantly. Unfortunately, he suspects that she might be interested in Sunakawa. Despite his romantic feelings for Yamato continuing to bloom, Takeo decides to act as her cupid, even as he yearns for his own love story. [Written by MAL Rewrite]",
        "year": 2015,
        "season": "spring",
        "studios": "Madhouse",
        "genres": "Comedy",
        "rank": 681,
        "images": "https://cdn.myanimelist.net/images/anime/13/69455l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "1943": {
        "id": "1943",
        "links": [
            "https://animethemes.moe/video/Paprika-OP1.webm",
            "https://animethemes.moe/video/Paprika-ED1.webm"
        ],
        "title": "Paprika",
        "synopsis": "The world of dreams can be an incredible window into the psyche, showing one's deepest desires, aspirations, and repressed memories. One hopeful tech lab has been developing the \"DC Mini,\" a device with the power to delve into the dreams of others. Atsuko Chiba and Kosaku Tokita have been tirelessly working to develop this technology with the hopes of using it to deeply explore patients' minds and help cure them of their psychological disorders. However, having access to the deepest corners of a person's mind comes with a tremendous responsibility. In the wrong hands, the DC Mini could be used as a form of psychological terrorism and cause mental breakdowns in the minds of targets. When this technology is stolen and people around them start acting strangely, Atsuko and Kosaku know they have a serious problem on their hands. Enlisting the help of Officer Konakawa, who has been receiving this experimental therapy, they search both the real and dream worlds for their mental terrorist. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Madhouse",
        "genres": "Avant Garde",
        "rank": 514,
        "images": "https://cdn.myanimelist.net/images/anime/1929/93629l.jpg",
        "rating": "R+ - Mild Nudity"
    },
    "437": {
        "id": "437",
        "links": [
            "https://animethemes.moe/video/PerfectBlue-ED1.webm"
        ],
        "title": "Perfect Blue",
        "synopsis": "J-pop idol group CHAM! has spent the last two years entertaining its fans. Sadly, all good things must come to an end, and CHAM! must see one of its members, Mima Kirigoe, leave the group to pursue her acting career. While Mima's choice is met with a mixed response, she hopes her fans will continue to support her. However, Mima's life begins to change drastically after her departure from the group. Wanting to shed her pop-idol image, she takes on a role in a crime drama series, and her career as an actress gradually becomes more demanding and taxing for both Mima and her manager, Rumi Hidaka. To add to Mima's growing unease, an obsessed fan who is incapable of accepting that Mima has quit being an innocent idol, begins stalking her; a new anonymous website begins to impersonate her life with intricate detail; and CHAM! also appears to be doing better without her. One by one, each disturbing development drives Mima to become increasingly unhinged and unable to distinguish reality from fantasy. [Written by MAL Rewrite]",
        "year": 2022,
        "season": "summer",
        "studios": "Madhouse",
        "genres": "Avant Garde",
        "rank": 108,
        "images": "https://cdn.myanimelist.net/images/anime/11/79127l.jpg",
        "rating": "R+ - Mild Nudity"
    },
    "13601": {
        "id": "13601",
        "links": [
            "https://animethemes.moe/video/PsychoPass-OP1.webm",
            "https://animethemes.moe/video/PsychoPass-OP2v2.webm",
            "https://animethemes.moe/video/PsychoPass-OP2.webm",
            "https://animethemes.moe/video/PsychoPass-ED1.webm",
            "https://animethemes.moe/video/PsychoPass-ED1v2.webm",
            "https://animethemes.moe/video/PsychoPass-ED2.webm",
            "https://animethemes.moe/video/PsychoPass-ED2v2.webm"
        ],
        "title": "Psycho-Pass",
        "synopsis": "Justice, and the enforcement of it, has changed. In the 22nd century, Japan enforces the Sibyl System, an objective means of determining the threat level of each citizen by examining their mental state for signs of criminal intent, known as their Psycho-Pass. Inspectors uphold the law by subjugating, often with lethal force, anyone harboring the slightest ill-will; alongside them are Enforcers, jaded Inspectors that have become latent criminals, granted relative freedom in exchange for carrying out the Inspectors' dirty work. Into this world steps Akane Tsunemori, a young woman with an honest desire to uphold justice. However, as she works alongside veteran Enforcer Shinya Kougami, she soon learns that the Sibyl System's judgments are not as perfect as her fellow Inspectors assume. With everything she has known turned on its head, Akane wrestles with the question of what justice truly is, and whether it can be upheld through the use of a system that may already be corrupt. [Written by MAL Rewrite]",
        "year": 2012,
        "season": "fall",
        "studios": "Production I.G",
        "genres": "Action",
        "rank": 194,
        "images": "https://cdn.myanimelist.net/images/anime/5/43399l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "31240": {
        "id": "31240",
        "links": [
            "https://animethemes.moe/video/ReZero-OP1.webm",
            "https://animethemes.moe/video/ReZero-OP2.webm",
            "https://animethemes.moe/video/ReZero-ED1v2.webm",
            "https://animethemes.moe/video/ReZero-ED1.webm",
            "https://animethemes.moe/video/ReZero-ED1v3.webm",
            "https://animethemes.moe/video/ReZero-ED2.webm",
            "https://animethemes.moe/video/ReZero-ED3.webm",
            "https://animethemes.moe/video/ReZero-ED3v2.webm",
            "https://animethemes.moe/video/ReZero-ED4.webm",
            "https://animethemes.moe/video/ReZero-ED5.webm",
            "https://animethemes.moe/video/ReZero-ED6.webm"
        ],
        "title": "Re:Zero kara Hajimeru Isekai Seikatsu",
        "synopsis": "When Subaru Natsuki leaves the convenience store, the last thing he expects is to be wrenched from his everyday life and dropped into a fantasy world. Things aren't looking good for the bewildered teenager; however, not long after his arrival, he is attacked by some thugs. Armed with only a bag of groceries and a now useless cell phone, he is quickly beaten to a pulp. Fortunately, a mysterious beauty named Satella, in hot pursuit after the one who stole her insignia, happens upon Subaru and saves him. In order to thank the honest and kindhearted girl, Subaru offers to help in her search, and later that night, he even finds the whereabouts of that which she seeks. But unbeknownst to them, a much darker force stalks the pair from the shadows, and just minutes after locating the insignia, Subaru and Satella are brutally murdered. However, Subaru immediately reawakens to a familiar scene—confronted by the same group of thugs, meeting Satella all over again—the enigma deepens as history inexplicably repeats itself. [Written by MAL Rewrite]",
        "year": 2016,
        "season": "spring",
        "studios": "White Fox",
        "genres": "Drama",
        "rank": 272,
        "images": "https://cdn.myanimelist.net/images/anime/11/79410l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "205": {
        "id": "205",
        "links": [
            "https://animethemes.moe/video/SamuraiChamploo-OP1.webm",
            "https://animethemes.moe/video/SamuraiChamploo-ED1.webm",
            "https://animethemes.moe/video/SamuraiChamploo-ED1v2.webm",
            "https://animethemes.moe/video/SamuraiChamploo-ED2.webm",
            "https://animethemes.moe/video/SamuraiChamploo-ED3.webm",
            "https://animethemes.moe/video/SamuraiChamploo-ED4.webm",
            "https://animethemes.moe/video/SamuraiChamploo-ED5.webm"
        ],
        "title": "Samurai Champloo",
        "synopsis": "Fuu Kasumi is a young and clumsy waitress who spends her days peacefully working in a small teahouse. That is, until she accidentally spills a drink all over one of her customers! With a group of samurai now incessantly harassing her, Fuu desperately calls upon another samurai in the shop, Mugen, who quickly defeats them with his wild fighting technique, utilizing movements reminiscent to that of breakdancing. Unfortunately, Mugen decides to pick a fight with the unwilling ronin Jin, who wields a more precise and traditional style of swordfighting, and the latter proves to be a formidable opponent. The only problem is, they end up destroying the entire shop as well as accidentally killing the local magistrate's son. For their crime, the two samurai are captured and set to be executed. However, they are rescued by Fuu, who hires the duo as her bodyguards. Though she no longer has a place to return to, the former waitress wishes to find a certain samurai who smells of sunflowers and enlists the help of the now exonerated pair to do so. Despite initially disapproving of this idea, the two eventually agree to assist the girl in her quest; thus, the trio embark upon an adventure to find this mysterious warrior—that is, if Fuu can keep Mugen and Jin from killing each other. Set in an alternate Edo Period of Japan, Samurai Champloo follows the journey of these three eccentric individuals in an epic quest full of action, comedy, and dynamic sword fighting, all set to the beat of a unique hip-hop infused soundtrack. [Written by MAL Rewrite]",
        "year": 2004,
        "season": "spring",
        "studios": "Manglobe",
        "genres": "Action",
        "rank": 119,
        "images": "https://cdn.myanimelist.net/images/anime/1375/121599l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    },
    "4382": {
        "id": "4382",
        "links": [
            "https://animethemes.moe/video/SuzumiyaHaruhiNoYuuutsu2009-OP1.webm",
            "https://animethemes.moe/video/SuzumiyaHaruhiNoYuuutsu2009-ED1.webm"
        ],
        "title": "Suzumiya Haruhi no Yuuutsu (2009)",
        "synopsis": "Kyon has found himself dragged through many adventures as of late—all because of the SOS Brigade club and its excitable leader, Haruhi Suzumiya. He has stopped believing in the supernatural long ago, but after being forced to join this club based solely on that, he has seen things that cannot be explained logically. Joining Kyon on his various misadventures is the shy and soft-spoken Mikuru Asahina, the bookish Yuki Nagato, and the ever-cheerful Itsuki Koizumi. Whether it is summer vacation or a school festival, things involving their club and Haruhi herself always end up becoming strange. [Written by MAL Rewrite]",
        "year": 2009,
        "season": "spring",
        "studios": "Kyoto Animation",
        "genres": "Comedy",
        "rank": 2905,
        "images": "https://cdn.myanimelist.net/images/anime/8/75377l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "12431": {
        "id": "12431",
        "links": [
            "https://animethemes.moe/video/UchuuKyoudai-OP1.webm",
            "https://animethemes.moe/video/UchuuKyoudai-OP2.webm",
            "https://animethemes.moe/video/UchuuKyoudai-OP3.webm",
            "https://animethemes.moe/video/UchuuKyoudai-OP4.webm",
            "https://animethemes.moe/video/UchuuKyoudai-OP5.webm",
            "https://animethemes.moe/video/UchuuKyoudai-OP6.webm",
            "https://animethemes.moe/video/UchuuKyoudai-OP7.webm",
            "https://animethemes.moe/video/UchuuKyoudai-OP8.webm",
            "https://animethemes.moe/video/UchuuKyoudai-ED1.webm",
            "https://animethemes.moe/video/UchuuKyoudai-ED2.webm",
            "https://animethemes.moe/video/UchuuKyoudai-ED3.webm",
            "https://animethemes.moe/video/UchuuKyoudai-ED4.webm",
            "https://animethemes.moe/video/UchuuKyoudai-ED5.webm",
            "https://animethemes.moe/video/UchuuKyoudai-ED6.webm",
            "https://animethemes.moe/video/UchuuKyoudai-ED7.webm",
            "https://animethemes.moe/video/UchuuKyoudai-ED8.webm"
        ],
        "title": "Uchuu Kyoudai",
        "synopsis": "On a fateful summer night in 2006, Mutta Nanba and his younger brother Hibito witness what they believe to be a UFO flying toward the Moon. This impressing and unusual phenomenon leads both siblings vowing to become astronauts, with Hibito aiming for the Moon and Mutta, convinced that the eldest brother has to be one step ahead, for Mars. Now an adult, life hasn't turned out how Mutta had pictured it: he is diligently working in an automotive company, whereas Hibito is on his way to be the very first Japanese man to step on the Moon. However, after losing his job, Mutta is presented with an unexpected opportunity to catch up to his younger brother when the Japanese Aerospace Exploration Agency, commonly known as JAXA, accepts his application to participate in the next astronaut selection. Despite self-doubts about his prospects, Mutta is unwilling to waste this chance of a lifetime, and thus embarks on an ambitious journey to fulfill the promise made 19 years ago. [Written by MAL Rewrite]",
        "year": 2012,
        "season": "spring",
        "studios": "A-1 Pictures",
        "genres": "Comedy",
        "rank": 112,
        "images": "https://cdn.myanimelist.net/images/anime/7/37573l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "10162": {
        "id": "10162",
        "links": [
            "https://animethemes.moe/video/UsagiDrop-OP1.webm",
            "https://animethemes.moe/video/UsagiDrop-ED1.webm"
        ],
        "title": "Usagi Drop",
        "synopsis": "Daikichi Kawachi is a 30-year-old bachelor working a respectable job but otherwise wandering aimlessly through life. When his grandfather suddenly passes away, he returns to the family home to pay his respects. Upon arriving at the house, he meets a mysterious young girl named Rin who, to Daikichi’s astonishment, is his grandfather's illegitimate daughter! The shy and unapproachable girl is deemed an embarrassment to the family, and finds herself ostracized by her father's relatives, all of them refusing to take care of her in the wake of his death. Daikichi, angered by their coldness toward Rin, announces that he will take her in—despite the fact that he is a young, single man with no prior childcare experience. Usagi Drop is the story of Daikichi's journey through fatherhood as he raises Rin with his gentle and affectionate nature, as well as an exploration of the warmth and interdependence that are at the heart of a happy, close-knit family. [Written by MAL Rewrite]",
        "year": 2011,
        "season": "summer",
        "studios": "Production I.G",
        "genres": "Slice of Life",
        "rank": 182,
        "images": "https://cdn.myanimelist.net/images/anime/2/29665l.jpg",
        "rating": "PG-13 - Teens 13 or older"
    },
    "270": {
        "id": "270",
        "links": [
            "https://animethemes.moe/video/Hellsing-OP1.webm",
            "https://animethemes.moe/video/Hellsing-ED1.webm"
        ],
        "title": "Hellsing",
        "synopsis": "Hellsing, an organization specializing in dealing with supernatural threats, is called in to eliminate a vampire that is turning the villagers of Cheddar into ghouls. To put an end to this, the leader of the organization, Sir Integra Fairbrook Wingates Hellsing, dispatches her most formidable asset: a powerful vampire known as Alucard. Armed with only a single handgun, Alucard wreaks havoc on the monsters plaguing Cheddar. However, a young police officer, Seras Victoria, gets caught up in the chaos and becomes mortally wounded as a result. Taking pity on the girl, Alucard gives her a choice: die as a human or live on as a vampire. Seras accepts his offer and begins a new life as a member of Hellsing. Though it was her decision, Seras struggles with the fact that she is no longer human. Nevertheless, she must embrace being a creature of the night soon if she wants to survive on the front lines in the fight between humans and the supernatural. [Written by MAL Rewrite]",
        "year": 2001,
        "season": "fall",
        "studios": "Gonzo",
        "genres": "Action",
        "rank": 1717,
        "images": "https://cdn.myanimelist.net/images/anime/10/19956l.jpg",
        "rating": "R - 17+ (violence & profanity)"
    }
}